[{"source": "wsj", "link": "https://www.wsj.com/articles/russian-bitcoin-and-other-cryptocurrencies-could-be-part-of-future-sanctions-11645902740", "title": "Russian Bitcoin, Other Cryptocurrencies Could Be Part of Future Sanctions", "date": "2022-02-26 15:49", "summary": "Cryptocurrencies make up a greater part of Russia's financial system than most other nations due to a distrust in its banking system. Washington is considering a novel area for possible further sanctions against Russia: cryptocurrencies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/steve-schwarzman-is-blackstones-billion-dollar-man-11645905308", "title": "Schwarzman Is Blackstone's Billion-Dollar Man", "date": "2022-02-26 14:55", "summary": "Blackstone CEO took home a record $1.1 billion in 2021, underscoring the private-equity giant's growing dominance on Wall Street. "}, {"source": "wsj", "link": "https://www.wsj.com/articles/discovery-to-name-chris-licht-to-run-cnn-11645892654", "title": "Discovery to Name Chris Licht to Run CNN", "date": "2022-02-26 14:43", "summary": "Mr. Licht is currently executive producer of 'The Late Show With Stephen Colbert'. Discovery Inc. has tapped producer Chris Licht to lead CNN after it takes over the cable-news channel, according to people familiar with the matter, turning to a veteran news and late-night TV showrunner to steady a network roiled by the sudden departure of its long-serving president."}, {"source": "wsj", "link": "https://www.wsj.com/articles/a-new-brand-of-sticker-shock-hits-the-car-market-11645851648", "title": "The New Sticker Shock", "date": "2022-02-26 13:21", "summary": "With vehicles in short supply, prices are skyrocketing. Last month, 82% of new-car buyers paid more than sticker price.. How hard is it to buy a car today? For Kevin Peters, it recently involved a one-way flight and 330-mile road trip to avoid overpaying for a new truck."}, {"source": "wsj", "link": "https://www.wsj.com/articles/berkshire-hathaway-net-earnings-rose-11-in-fourth-quarter-11645881386", "title": "Berkshire Net Earnings Rose 11%", "date": "2022-02-26 12:37", "summary": "Warren Buffett's conglomerate recorded $90 billion net earnings for 2021. A growing economy propelled Berkshire Hathaway Inc.'s railroad, energy and consumer businesses, pushing net earnings up 11% in the fourth quarter. And a powerful stock market nearly doubled the conglomerate's investment gains for the full year."}, {"source": "wsj", "link": "https://www.wsj.com/articles/locked-out-of-your-account-after-three-tries-it-makes-no-sense-11645894800", "title": "Locked Out of Your Account After Three Tries. It Makes No Sense.", "date": "2022-02-26 12:00", "summary": "We discovered the optimal number of password errors-where lockouts were reduced, with no adverse effect on security. Here's a scenario that no doubt sounds familiar. You type in a password to get into one of your accounts. The first two times, you type in the wrong password. Then you remember the right one. But your finger slips as you type it."}, {"source": "wsj", "link": "https://www.wsj.com/articles/with-agricultural-commodities-volatile-u-s-seeks-new-markets-11645889122", "title": "With Agricultural Commodities Volatile, U.S. Seeks New Markets", "date": "2022-02-26 10:25", "summary": "Biden administration aims to reduce U.S. reliance on exports to China while trying to increase sales elsewhere. Earlier this month, the first shipment of American wheat arrived in Ho Chi Minh City since Vietnam dropped its tariff on such imports in December."}, {"source": "wsj", "link": "https://www.wsj.com/articles/senior-communities-add-tech-assistance-11645828561", "title": "Senior Communities Add Tech Assistance as One of Their Perks", "date": "2022-02-26 10:00", "summary": "Residents need help downloading apps, making Zoom calls, logging into doctors' appointments and much more. Frank Diaz offers weekly classes on topics like downloading apps and using QR codes. He also meets one-on-one with people, helping them to manage passwords or buy the right tablets."}, {"source": "wsj", "link": "https://www.wsj.com/articles/are-virtual-worlds-safe-for-children-11645880401", "title": "Are Virtual Worlds Safe for Children?", "date": "2022-02-26 08:00", "summary": "It isn't clear what happens to a child's mind after spending hours upon hours in made-up worlds. But we may know soon enough.. Virtual worlds are about to take a huge leap in realism and immersion."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cnn-probe-finds-allison-gollust-assisted-chris-cuomo-in-his-efforts-to-help-andrew-cuomo-11645829880", "title": "CNN Probe Finds Gollust Provided Guidance to Cuomo", "date": "2022-02-26 19:04", "summary": "Spokeswoman for ex-CNN marketing chief says notion that messages to Chris Cuomo could be considered covert advice to Andrew Cuomo 'is patently ridiculous'. "}]