[{"source": "wsj", "link": "https://www.wsj.com/articles/starbucks-workers-set-for-another-vote-to-unionize-11645811983", "title": "Starbucks Workers Vote to Form Union at Arizona Cafe", "date": "2022-02-25 18:52", "summary": "Baristas' vote set to create third unionized corporate store after Buffalo, N.Y., cafes voted to organize in December. Starbucks Corp. baristas voted to unionize at a third company cafe, as the chain has intensified efforts to win over employees who have held pro-union rallies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-02-25-22-11645771218", "title": "U.S. Stocks Rally to Finish Turbulent Week", "date": "2022-02-25 18:52", "summary": "Possibility of Russia-Ukraine talks lifts markets; Russian shares, ruble jump. The stock market capped a turbulent week by rallying Friday, as investors furiously shifted bets on how the Federal Reserve will proceed with interest-rate increases in the wake of Russia's invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/lowes-sofi-carvana-stocks-that-defined-the-week-11645830811", "title": "Lowe's, SoFi, Carvana: Stocks That Defined the Week", "date": "2022-02-25 18:13", "summary": "Here are seven major companies whose stocks moved on the week's news. Lowe's Cos."}, {"source": "wsj", "link": "https://www.wsj.com/articles/zendesk-terminates-deal-with-surveymonkey-parent-11645830504", "title": "Zendesk Scraps Deal With SurveyMonkey Parent", "date": "2022-02-25 18:08", "summary": "Agreement had required approval from both companies' investors in votes held Friday. Zendesk Inc. said it has terminated its deal with the parent of web-survey company SurveyMonkey after its shareholders rejected the agreement at a stockholder meeting."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-offshore-wind-power-auction-nets-record-4-37-billion-11645819133", "title": "U.S. Offshore Wind Power Auction Nets Record $4.37 Billion", "date": "2022-02-25 17:45", "summary": "Sale of locations in federal waters marks key moment in President Biden's bid to create U.S. offshore wind industry. A U.S. auction of locations for offshore wind farms on the Atlantic coast resulted in a record $4.37 billion in winning bids, officials said Friday, a sign of robust interest in developing renewable energy in federal waters."}, {"source": "wsj", "link": "https://www.wsj.com/articles/block-shares-rebound-on-growth-outlook-11645811667", "title": "Block Shares Rebound on Growth Outlook", "date": "2022-02-25 17:22", "summary": "Fintech company sees gross profit rising sequentially in each quarter this year. A rosier-than-expected outlook for growth for financial-tech services like Square and Cash App spurred a record rally in the stock price of their parent company, Block Inc."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-stocks-rebounded-after-russia-invaded-ukraine-11645791640", "title": "Why Stocks Rebounded After Russia Invaded Ukraine", "date": "2022-02-25 17:14", "summary": "It was a great stock-market switcheroo. Expect markets to keep swinging about as reality intrudes.. Russia invaded Ukraine to start the biggest land war in Europe since Hitler. U.S. stocks soared. What gives?"}, {"source": "wsj", "link": "https://www.wsj.com/articles/foot-locker-shares-tumble-amid-weak-sales-forecast-pledge-to-cut-nike-purchases-11645799962", "title": "Foot Locker Shares Tumble", "date": "2022-02-25 16:59", "summary": "Footwear and apparel seller cites efforts to overhaul business, waning boost from government stimulus. For Foot Locker Inc., kicking the Nike habit is hard."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ford-plans-to-pause-f-150-production-at-missouri-plant-next-week-11645825319", "title": "Ford Plans to Pause F-150 Production at Missouri Plant", "date": "2022-02-25 16:41", "summary": "The one-week suspension follows similar cuts earlier this month as auto makers deal with lingering chip shortage. Ford Motor Co. said it plans to stop production of the F-150 pickup truck at a Missouri assembly plant for a week because of the global semiconductor-chip shortage, which continues to disrupt the automotive industry."}, {"source": "wsj", "link": "https://www.wsj.com/articles/estee-lauder-executive-john-demsey-apologizes-after-posting-meme-on-instagram-11645823869", "title": "Estée Lauder Executive Demsey Apologizes After Posting Meme", "date": "2022-02-25 16:27", "summary": "Cosmetics company earlier this week suspended the executive group president, who says 'I hurt many people whom I respect'. A senior Estée Lauder Cos. executive has apologized for posting a meme on his personal Instagram account that contained a racial slur and a joke about Covid-19."}, {"source": "wsj", "link": "https://www.wsj.com/articles/bp-faces-pressure-from-u-k-government-over-stake-in-russias-rosneft-11645817245", "title": "BP Faces Pressure From U.K. Government Over Stake in Russia's Rosneft", "date": "2022-02-25 15:46", "summary": "British oil giant owns 20% interest in Russia oil producer, which London accuses of providing fuel for Russian army's advance in Ukraine. LONDON-The British government is pressuring British oil giant BP PLC to offload its minority stake in Russian oil company PAO Rosneft, citing the Russian oil giant's links to the Kremlin and accusing Rosneft of fueling the Russian army's advance into Ukraine, according to a person familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cargo-ship-is-towed-after-fire-destroyed-thousands-of-luxury-cars-aboard-11645820537", "title": "Cargo Ship Is Towed After Fire Destroyed Thousands of Luxury Cars Aboard", "date": "2022-02-25 15:22", "summary": "Volkswagen says a large part of the cargo was lost in the blaze that started more than a week ago. BERLIN-Salvage crews boarded the Felicity Ace merchant ship that caught fire with a cargo of luxury Porsche , Bentley, Lamborghini, Audi and Volkswagen vehicles, and began towing the vessel to safety, the operator of the ship said Friday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sec-proposes-rules-for-more-disclosure-from-short-sellers-11645804875", "title": "SEC Proposes Rules for More Disclosure from Short Sellers", "date": "2022-02-25 14:23", "summary": "New rules aim to enhance regulators' understanding of market events, agency says. WASHINGTON-Investors who make big bets against company stocks could soon have to report more information about their positions to the Securities and Exchange Commission."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cash-app-is-king-for-block-stock-11645807732", "title": "Cash App Is King for Block Stock", "date": "2022-02-25 11:49", "summary": "A reacceleration of growth in the payments and neobanking app is reigniting investors' faith in the fintech darling. Block 's Cash App is money again for investors in the fintech giant."}, {"source": "wsj", "link": "https://www.wsj.com/articles/etsy-shares-rise-on-strong-sales-report-11645804911", "title": "Etsy Shares Rise on Higher Sales", "date": "2022-02-25 11:27", "summary": "Crafts-focused online marketplace has benefited from shopping trends during the pandemic. Etsy Inc.'s shares jumped Friday after the online marketplace said shoppers continued to come to its platform to buy from smaller sellers amid supply-chain challenges besetting other retailers."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-to-invest-calmly-in-a-chaotic-world-intelligent-investor-11645806146", "title": "How to Invest Calmly in a Chaotic World", "date": "2022-02-25 11:23", "summary": "You don't have to act on your own forecasts about global events. You don't even have to make any.. When the world turns upside down, starkly simple views are reassuring. Yet it's at those very moments that investors need to be even more skeptical about takes that smack of certainty."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-block-trading-investigation-hits-morgan-stanleys-plans-to-expand-in-china-11645805036", "title": "Morgan Stanley's China Plans Hit by Block-Trading Probe", "date": "2022-02-25 11:03", "summary": "China's securities regulator cites U.S. probe, problems that arose in local inspection of bank's securities business. A U.S. investigation into block trading by Wall Street firms has ricocheted to China, potentially slowing Morgan Stanley 's plans to expand its control of its brokerage and fund management businesses."}, {"source": "wsj", "link": "https://www.wsj.com/articles/beyond-meat-hit-by-slower-supermarket-sales-of-plant-based-food-11645804374", "title": "Beyond Meat Hit By Slower Supermarket Sales", "date": "2022-02-25 10:52", "summary": "Meat alternative maker says slowdown is temporary; Beyond is developing new products and ramping up efforts in grocery stores. Beyond Meat Inc . shares dropped Friday after the plant-based meat alternative maker reported a bigger-than-anticipated quarterly loss and a sharp decline in U.S. grocery sales."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-sanctions-against-vtb-and-sberbank-aim-to-disrupt-russias-economy-11645800587", "title": "U.S. Sanctions Against VTB and Sberbank Aim to Disrupt Russia's Economy", "date": "2022-02-25 09:49", "summary": "The U.S. cut Russia's two largest banks from direct access to the U.S. dollar, curtailing their activities. U.S. sanctions on Russia's two largest banks are the toughest measures yet against the country's financial system, but leave room for businesses to maneuver, especially in the critical energy sector."}, {"source": "wsj", "link": "https://www.wsj.com/articles/coinbase-beyond-meat-block-etsy-farfetch-what-to-watch-when-the-stock-market-opens-today-11645789858", "title": "Coinbase, Beyond Meat, Block, Etsy, Farfetch: What to Watch in the Stock Market Today", "date": "2022-02-25 09:39", "summary": "Coinbase's income more than quadrupled; Etsy delivered an earnings beat. Wall Street stock indexes were mixed in opening trading after the Kremlin agreed to talks with the Ukraine government, saying Moscow was willing to send a delegation to the Belarusian capital, Minsk. (live blog here). Here's what we're watching in Friday's trading."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russias-ukraine-invasion-chokes-food-exports-from-global-breadbasket-11645798059", "title": "Russia's Ukraine Invasion Chokes Food Exports From Global Breadbasket", "date": "2022-02-25 09:07", "summary": "Prices for wheat jumped to their highest levels in 12 years, adding to pressure on global food inflation. Russia's invasion of Ukraine throttled exports from one of the world's largest grain suppliers after the country's ports went quiet and traders halted operations."}, {"source": "wsj", "link": "https://www.wsj.com/articles/china-orders-hong-kong-to-get-covid-19-under-control-before-xis-july-visit-11645794395", "title": "China Orders Hong Kong to Get Covid-19 Under Control Before Xi's July Visit", "date": "2022-02-25 08:06", "summary": "A top Chinese official expressed Beijing's frustration over the city's response to the Omicron outbreak at a recent meeting on the mainland. HONG KONG-As Covid-19 cases spiraled and elderly Hong Kong residents lay on gurneys outside overwhelmed hospitals, Chinese Vice Premier Han Zheng summoned the city's leader, Carrie Lam, to a closed-door meeting in the mainland city of Shenzhen."}, {"source": "wsj", "link": "https://www.wsj.com/articles/getting-ready-for-a-tough-tax-season-11645793877", "title": "Getting Ready for a Tough Tax Season", "date": "2022-02-25 07:57", "summary": "Test your knowledge of the tax code with the Journal's quiz. Then read the WSJ Tax Guide 2022 to learn more.. Tax-filing season is in full swing."}, {"source": "wsj", "link": "https://www.wsj.com/articles/etsys-basket-has-some-holes-11645792380", "title": "Etsy's Basket Has Some Holes", "date": "2022-02-25 07:33", "summary": "Business has boomed in the past two years, for obvious reasons, but growing in the same way going forward will be more challenging and expensive. Don't let its granola vibe fool you: Etsy is a selling machine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-war-shifts-balance-of-poweramong-airlines-11645791596", "title": "Ukraine War Shifts Balance of Power-Among Airlines", "date": "2022-02-25 07:19", "summary": "Russia's attack has hit all European airline stocks hard, but some carriers are much more exposed than others. The exclusion of energy from sanctions has calmed immediate fears of a deep market impact from the war in Ukraine. But one sector still looks as exposed as it is to every crisis: airlines."}, {"source": "wsj", "link": "https://www.wsj.com/articles/zoom-has-some-tough-calls-to-make-11645790580", "title": "Zoom Has Some Tough Calls to Make", "date": "2022-02-25 07:03", "summary": "Videoconferencing star needs to gain sales muscle while curbing free use as market punishes 'investment mode' stocks. For those still inclined to think of Zoom Video Communications as a \"pandemic stock,\" consider that Covid-19 has well outlasted that status."}, {"source": "wsj", "link": "https://www.wsj.com/articles/south-korea-wants-to-graduate-from-emerging-markets-11645786835", "title": "South Korea Wants to Graduate From Emerging Markets", "date": "2022-02-25 06:00", "summary": "If it succeeds, it could become the first country to secure developed-market status from MSCI since Israel was elevated in 2010. South Korea is reviving a longstanding push to be upgraded to a developed market by MSCI Inc., a change that could pull in more than $40 billion in foreign capital."}, {"source": "wsj", "link": "https://www.wsj.com/articles/alibaba-shares-are-cheap-but-not-a-bargain-11645778437", "title": "Alibaba Shares Are Cheap, but Not a Bargain", "date": "2022-02-25 03:43", "summary": "China's e-commerce champion is still taking blows from multiple sides, but a deepening funk among consumers is now adding to regulatory headwinds. Chinese e-commerce giant Alibaba has been sailing through a regulatory windstorm for more than a year now. A slowing economy and new competitive pressures are adding to already blustery conditions."}, {"source": "wsj", "link": "https://www.wsj.com/articles/playtika-shares-rise-more-than-13-after-company-says-its-exploring-strategic-options-including-a-sale-11645748263", "title": "Playtika Shares Rise More Than 10% After Company Says It's Exploring Strategic Options", "date": "2022-02-25 20:04", "summary": "The mobile videogame developer's shares had fallen sharply from last year's high to below their IPO price. Mobile-videogame company Playtika Holding Corp. said it is exploring strategic alternatives for its business, including a possible sale, amid a recent wave of industry consolidation."}]