[{"source": "wsj", "link": "https://www.wsj.com/articles/land-buildings-nominates-founder-litt-to-ventas-board-11646607600", "title": "Land & Buildings Nominates Founder Litt to Ventas Board", "date": "2022-03-06 18:00", "summary": "The real-estate focused investment firm owns roughly $50 million of the healthcare REIT's shares. A shareholder activist is pushing to join the board of Ventas Inc., arguing the healthcare real-estate investment trust would benefit from an investor's perspective."}, {"source": "wsj", "link": "https://www.wsj.com/articles/tiktok-and-netflix-pull-back-from-russia-adding-to-its-tech-and-media-isolation-11646606867", "title": "TikTok and Netflix Pull Back From Russia", "date": "2022-03-06 17:47", "summary": "Chinese-owned social-media platform halts new content in Russia in response to 'fake news' law; U.S. streaming giant suspends its service there amid operational challenges. TikTok on Sunday suspended new content from Russia and Netflix Inc. halted its service there, adding to moves by tech and media companies to pull back from the country following its invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-recruiting-syrians-for-urban-combat-in-ukraine-u-s-officials-say-11646606234", "title": "Russia Recruiting Syrians for Urban Combat in Ukraine, U.S. Officials Say", "date": "2022-03-06 17:37", "summary": "Moscow is looking for help from foreign fighters to take cities including Kyiv. WASHINGTON-Moscow is recruiting Syrians skilled in urban combat to fight in Ukraine as Russia's invasion is poised to expand deeper into cities, according to U.S. officials."}, {"source": "wsj", "link": "https://www.wsj.com/articles/carl-icahn-exits-occidental-petroleum-after-nearly-three-years-11646596800", "title": "Carl Icahn Exits Occidental After Nearly Three Years", "date": "2022-03-06 15:00", "summary": "In a letter to the company's board, the activist investor says his two remaining board representatives are also resigning. Carl Icahn exited a big bet on Occidental Petroleum Corp. , selling the last of what was once a roughly 10% stake in the oil-and-gas producer as its shares surge."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-banks-turn-to-china-to-sidestep-cutoff-from-payments-systems-11646578489", "title": "Russian Banks Turn to China to Sidestep Cutoff From Payments Systems", "date": "2022-03-06 14:18", "summary": "Sberbank, Alfa Bank and Tinkoff Bank said they are working on the possibility of issuing cards powered by China's UnionPay. Russian banks that have been cut off from global payments networks are turning to China's state-owned UnionPay system as the country tries to sidestep boycotts by Western businesses for its invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/a-brooding-the-batman-revives-moviegoing-with-top-opening-this-year-11646593775", "title": "A Brooding 'The Batman' Revives Moviegoing With Top Opening This Year", "date": "2022-03-06 14:09", "summary": "Warner Bros. debut grossed $128.5 million this weekend, trailing only 'Spider-Man: No Way Home' as biggest movie of pandemic. Batman can add another vanquished villain to his résumé: the dreary start to this year's Hollywood box office."}, {"source": "wsj", "link": "https://www.wsj.com/articles/investors-start-buying-ukraine-russia-bonds-11646568002", "title": "Investors Start Buying Ukraine, Russia Bonds", "date": "2022-03-06 13:41", "summary": "Distressed-debt funds swoop in as war pushes bond prices down. Investors are starting to buy Ukrainian and Russian bonds that plummeted to discounted prices, betting that they will recover if the war between the two countries comes to an end."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-stock-funds-down-7-9-for-2022-11646501671", "title": "U.S.-Stock Funds Down 7.9% for 2022", "date": "2022-03-06 12:00", "summary": "Reaction to Russia's invasion of Ukraine and worries about the Federal Reserve worsened the outlook for investment-grade bonds, too. The rough start to 2022 continued for U.S. investors."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-permits-payments-to-foreign-bondholders-but-only-with-rubles-11646585256", "title": "Russia Permits Payments to Foreign Bondholders, but Only With Rubles", "date": "2022-03-06 11:47", "summary": "The first test comes with Rosneft and Gazprom dollar bonds maturing. Russia will allow borrowers to make payments on their overseas debt, but only using rubles even for bonds denominated in foreign currencies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/dollar-strength-builds-as-ukraine-war-deepens-11646575604", "title": "Dollar Strength Builds as Ukraine War Deepens", "date": "2022-03-06 09:09", "summary": "The ICE U.S. Dollar index hits its highest level since May 2020 as investors dash to safer assets. Escalating conflict between Russia and Ukraine has sent investors dashing to safer assets, propelling the dollar to its highest level since the coronavirus-induced volatility of two years ago."}, {"source": "wsj", "link": "https://www.wsj.com/articles/what-you-should-know-about-investing-in-commodities-11646575202", "title": "What You Should Know About Investing in Commodities", "date": "2022-03-06 09:00", "summary": "Recent strong performance has attracted a lot of neophytes. They may have much to learn.. After years in the investing wilderness, commodities are hot again. And it looks as if the rally may continue for at least the foreseeable future, some analysts say."}, {"source": "wsj", "link": "https://www.wsj.com/articles/investors-see-bullish-signals-under-the-stock-markets-surface-11646538735", "title": "Investors See Bullish Signals Under the Stock Market's Surface", "date": "2022-03-06 09:00", "summary": "Despite recent volatility, a variety of individual stocks have broken out. It's been a rocky spell for stocks. Under the market's surface, some investors see promising signs."}, {"source": "wsj", "link": "https://www.wsj.com/articles/restaurants-debate-masks-as-covid-19-rules-rapidly-disappear-11646571601", "title": "Restaurants Debate Masks as Covid-19 Rules Rapidly Disappear", "date": "2022-03-06 08:00", "summary": "Shake Shack keeps facial coverings, Texas Roadhouse drops them as Americans are divided on the issue. Covid-19 restrictions are easing. Restaurants are deciding whether to keep masks on the menu."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oil-buyers-paying-record-premiums-for-prompt-deliveries-11646518865", "title": "Oil Buyers Paying Record Premiums for Prompt Deliveries", "date": "2022-03-06 05:33", "summary": "Lower prices for oil later this year and into 2023 reflect expectations of diminished demand, increased production. Oil buyers have been paying the biggest premiums on record for barrels delivered now rather than later, signaling expectations that high fuel prices will reduce consumption and encourage drilling to replace Russia's taboo crude."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-work-technology-harder-to-use-than-personal-tech-11646430437", "title": "Why Is Workplace Technology So Much Harder to Use Than Personal Technology?", "date": "2022-03-06 05:30", "summary": "There are legitimate reasons. But the gap is much greater than it should be. Here's how to narrow it.. As anybody who uses personal technology knows, most devices and software are pretty easy to use. Apps on our smartphones make services available at the push of a button. Software can be easily installed and configured with one click. Plug a printer into a USB port on a laptop, and it's ready to print."}, {"source": "wsj", "link": "https://www.wsj.com/articles/vistas-robert-smith-had-bigger-role-in-alleged-tax-fraud-than-previously-known-documents-show-11646562600", "title": "Vista CEO Had Bigger Role in Alleged Tax Fraud Than Previously Known, Documents Show", "date": "2022-03-06 05:30", "summary": "The private-equity firm CEO played a key role in a transaction that allowed billionaire Robert Brockman to move $635 million offshore without paying taxes, IRS court filing shows. Robert Smith, the billionaire chief executive of private-equity firm Vista Equity Partners, played a larger role than previously known in the $2 billion alleged tax evasion of his former business partner, recently filed court documents show."}]