[{"source": "wsj", "link": "https://www.wsj.com/articles/italy-seizes-russian-oligarchs-yachts-and-villas-11646493772", "title": "In Hunt For Russian Oligarch's Wealth, French Customs Officers on the Cote d'Azur Got a Tip", "date": "2022-03-05 14:14", "summary": "After showing up at the 280-foot yacht Amore Vero, they found the captain was making preparations to depart, triggering the ship's impoundment. Customs officers along France's sun-splashed Côte d'Azur had a tip."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russias-aviation-isolation-grows-as-planes-stay-put-11646505861", "title": "Russia's Aviation Isolation Grows as Planes Stay Put", "date": "2022-03-05 13:44", "summary": "Moscow fears the impounding abroad of around 500 Russian-operated commercial planes amid widespread sanctions against its airlines. London-Russian flag carrier Aeroflot Saturday said it would halt flights abroad as the country's aviation authority placed limits on what planes could head outside its borders, increasing Russia's isolation from the global air transport system."}, {"source": "wsj", "link": "https://www.wsj.com/articles/what-companies-have-pulled-back-from-russia-11646425481", "title": "What Companies Have Pulled Back From Russia?", "date": "2022-03-05 12:00", "summary": "Western businesses such as Apple, Boeing and Volkswagen are re-evaluating operations in Russia after its invasion of Ukraine. Russia's invasion of Ukraine has prompted many Western companies across industries to re-evaluate their businesses in Russia. Some have decided to suspend operations in the country, while others have decided to pull out entirely."}, {"source": "wsj", "link": "https://www.wsj.com/articles/not-all-stocks-are-equal-in-tech-bust-11646492689", "title": "In Tech's Bust, Not All Stock Funds Have Fallen Equally-or at All", "date": "2022-03-05 11:04", "summary": "Here's a look at how different companies, sectors and funds are faring in an overall dismal environment. Ali Khan, Fidelity Investments' co-sector leader for technology, has spent most of the past few months overseeing some of the very few technology mutual funds still in the green since last fall. His returns were never huge- (FDCPX) was up just 1.4% from Oct. 31 through January-and have withered since Russia invaded Ukraine last month. Still, with the benchmark ETF (QQQ), which tracks the Nasdaq-100 Index, falling 16% year to date, a handful of tech funds have looked like the best-painted houses in a rough neighborhood."}, {"source": "wsj", "link": "https://www.wsj.com/articles/the-week-rivian-and-lucid-drove-off-course-11646492580", "title": "The Week Rivian and Lucid Drove Off Course", "date": "2022-03-05 10:03", "summary": "Electric-vehicle startups are bets on aggressive growth plans that are being disrupted by parts shortages and cost inflation. Even the best electric-vehicle startups are giving investors few reasons to buy the dip."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-food-medicine-shortages-trigger-global-response-11646410820", "title": "Food and Medicine Shortages in Ukraine Prompt Global Relief Effort", "date": "2022-03-05 09:15", "summary": "Fozzy Group, Ukraine's largest supermarket chain, is working to keep doors open amid the fighting. With food and medicine supplies threatened across Ukraine, domestic and international food manufacturers, distributors and aid workers are mobilizing to keep grocery stores and pharmacies open and shelves stocked."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-war-sanctions-hit-middle-east-sovereign-wealth-funds-russia-bets-11646451439", "title": "Ukraine War Sanctions Hit Middle East Sovereign-Wealth Funds' Russia Bets", "date": "2022-03-05 08:00", "summary": "The Qatar Investment Authority has suffered some of the biggest losses. DUBAI-Persian Gulf sovereign-wealth funds have suffered some of the worst losses from falling asset prices in Russia since the invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-targets-media-outlets-with-fake-news-law-blocks-facebook-11646442530", "title": "Russia Targets Media Outlets With 'Fake News' Law, Blocks Facebook", "date": "2022-03-05 07:22", "summary": "CNN to stop broadcasting in Russia; BBC, Bloomberg News suspend work of their journalists in country. Russia passed a law that threatens prison time for anyone publishing what authorities consider to be false information about the country's invasion of Ukraine, which the Kremlin refers to as a special military operation."}, {"source": "wsj", "link": "https://www.wsj.com/articles/gig-app-gathering-data-for-u-s-military-others-prompts-safety-concerns-11646481601", "title": "Gig App Gathering Data for U.S. Military, Others Prompts Safety Concerns", "date": "2022-03-05 07:00", "summary": "Briefly banned in Ukraine, U.S. mobile-phone app Premise does defense work globally and has faced contributor safety issues. WASHINGTON-In 2019, Ukrainian users of a U.S.-based mobile-phone app offering paid, short-term tasks got what sounded like a straightforward assignment: Go into rural Ukraine and take smartphone photos of certain fields and farms around Odessa and Kyiv."}, {"source": "wsj", "link": "https://www.wsj.com/articles/europe-fears-it-could-be-too-late-to-shake-off-russian-gas-addiction-11646476200", "title": "Europe Fears It Could Be Too Late to Shake Off Russian Gas Addiction", "date": "2022-03-05 05:30", "summary": "A decadeslong reliance on Moscow's energy has left Europe unprepared if taps are turned off. Russian President Vladimir Putin's war in Ukraine has jolted Europe's slow-moving efforts to wean itself off Russian natural gas, but time is running out, threatening to leave consumers cold and factories idle by next winter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/red-flags-that-trigger-an-irs-tax-audit-11646426329", "title": "10 Red Flags That Could Trigger an IRS Tax Audit in 2022", "date": "2022-03-05 00:09", "summary": "Accounting for pandemic-inspired grants, loans and tax credits could make it a tricky year for many. For most Americans, any letter from the Internal Revenue Service sparks fear, especially a notice of a tax audit."}]