[{"source": "wsj", "link": "https://www.wsj.com/articles/germany-puts-russian-gas-pipeline-on-hold-amid-ukraine-crisis-raising-supply-worry-11645546318", "title": "Germany Puts Nord Stream 2 Pipeline On Hold, Raising Supply Worry", "date": "2022-02-22 18:49", "summary": "Berlin reassesses Russian natural-gas project despite Europe's winter of surging prices and concern over future supplies. Russia's troop deployment to two breakaway regions of Ukraine threatens to extend Europe's energy crisis, after Germany put a major natural-gas pipeline on hold and traders grew concerned Moscow would withhold gas in retaliation."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oil-prices-approach-100-on-threat-of-ukraine-war-11645528112", "title": "Oil Prices Approach $100 on Threat of Ukraine War", "date": "2022-02-22 17:53", "summary": "Natural-gas prices surge in Europe after Germany halts Nord Stream 2 pipeline; wheat also rises. Oil, natural-gas and agricultural prices rose as escalating tensions over Ukraine threatened to disrupt flows of natural resources from Eastern Europe to world markets."}, {"source": "wsj", "link": "https://www.wsj.com/articles/home-depots-latest-quarter-of-sales-growth-sustains-pandemic-era-gains-11645530894", "title": "Home Depot Expects Sales Growth to Slow in 2022", "date": "2022-02-22 17:11", "summary": "Latest quarter sustains pandemic-era gains from a flood of home-improvement activity. Sales growth will likely slow this year for Home Depot Inc., the home-improvement retailer said Tuesday, an indication that the sector's rapid expansion during the Covid-19 pandemic is moderating."}, {"source": "wsj", "link": "https://www.wsj.com/articles/bearish-bets-against-markets-are-surging-11645525800", "title": "Bearish Bets Against Markets Are Surging", "date": "2022-02-22 17:06", "summary": "Investors are loading up their bets against a number of big tech stocks, positioning for a reversal. Investors are wagering that the recent pain in markets will intensify."}, {"source": "wsj", "link": "https://www.wsj.com/articles/salvage-crews-set-to-board-burning-ship-carrying-luxury-car-payload-11645558367", "title": "Salvage Crews Set to Board Burning Ship Carrying Luxury-Car Payload", "date": "2022-02-22 17:05", "summary": "As fires recede, focus set to turn to whether electric cars caused the blaze. The blaze aboard the Felicity Ace, a 60,000-ton merchant ship loaded with luxury cars adrift in the Atlantic, is receding, which could allow the company charged with salvaging the ship to board it on Wednesday and stop it from drifting further out to sea, a Portuguese navy official said."}, {"source": "wsj", "link": "https://www.wsj.com/articles/macys-posts-quarterly-gains-helped-by-digital-sales-11645536430", "title": "Macy's Opts Against Separation of E-Commerce Business", "date": "2022-02-22 16:48", "summary": "The department-store chain posted quarterly gains, and said it is entering 2022 a much stronger company than pre-pandemic. Macy's Inc. has opted against separating its e-commerce business from its bricks-and-mortar stores amid calls from an activist investor to increase shareholder returns."}, {"source": "wsj", "link": "https://www.wsj.com/articles/rokus-island-in-the-stream-takes-on-some-water-11645536874", "title": "Roku's Island in the Stream Takes on Some Water", "date": "2022-02-22 16:30", "summary": "Streaming TV pioneer's plans to raise investments to boost growth come as faltering hardware sales gives another cause for worry. Roku was really on fire for a couple of seasons."}, {"source": "wsj", "link": "https://www.wsj.com/articles/volkswagens-porsche-ipo-wont-put-investors-first-11645553693", "title": "Volkswagen's Porsche IPO Won't Put Investors First", "date": "2022-02-22 14:39", "summary": "A deal to give luxury-car brand its own stock-market listing would be more about raising money for VW's electric-vehicle push. Plans by companies to sell stakes in juicy noncore assets have a reputation for being shareholder-friendly. But pleasing investors isn't chiefly what Volkswagen 's potential initial public offering of Porsche is about."}, {"source": "wsj", "link": "https://www.wsj.com/articles/macys-opts-for-smaller-makeover-11645555966", "title": "Macy's Opts for Smaller Makeover", "date": "2022-02-22 13:52", "summary": "Activist investor pushing for spinoff didn't get what it wanted, but push seems to have highlighted Macy's growing strength in e-commerce. Sometimes a slight tweak yields a better look than a full-on makeover."}, {"source": "wsj", "link": "https://www.wsj.com/articles/nfts-move-beyond-arts-and-entertainment-11645546723", "title": "How NFTs Can Move Beyond Arts and Entertainment", "date": "2022-02-22 13:08", "summary": "Nonfungible tokens have great potential in education and healthcare, and to drive social-impact efforts. NFTs are all the rage. These digital tokens-often associated with digital art and collectibles, songs, videos and designs-are everywhere, but they are more than novel art. In fact, NFTs may offer solutions, at least in part, to some of society's challenges."}, {"source": "wsj", "link": "https://www.wsj.com/articles/volkswagen-in-advanced-talks-over-porsche-ipo-11645525495", "title": "Volkswagen in Advanced Talks Over Porsche IPO", "date": "2022-02-22 12:57", "summary": "Move could help the car maker raise the cash needed for investment in electric vehicles. BERLIN- Volkswagen AG and the heirs of Beetle designer Ferdinand Porsche, the company's largest shareholder, said on Tuesday they are in advanced talks that could lead to the initial public offering of the iconic Porsche AG sports-car maker."}, {"source": "wsj", "link": "https://www.wsj.com/articles/standard-general-to-buy-tv-broadcaster-tegna-for-5-4-billion-11645548301", "title": "Standard General to Buy TV Broadcaster Tegna for $5.4 Billion", "date": "2022-02-22 11:45", "summary": "Tegna owns 64 U.S. TV stations in 51 different markets as well as the True Crime, Twist and Quest networks. Hedge fund Standard General LP said it has struck a deal valued at $5.4 billion to buy TV broadcaster Tegna Inc., ending years of takeover talks."}, {"source": "wsj", "link": "https://www.wsj.com/articles/equinix-is-the-biggest-gainer-in-the-management-top-250-11645546988", "title": "Equinix Is the Biggest Gainer in the Management Top 250", "date": "2022-02-22 11:23", "summary": "The data-center operator's overall score was driven by a big gain in its innovation score.. Equinix Inc. posted the biggest gain in overall score of any company in the Management Top 250 ranking for 2021, followed by Capital One Financial Corp ."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hsbc-faces-crucial-test-from-rising-rates-11645544721", "title": "HSBC Faces Crucial Test From Rising Rates", "date": "2022-02-22 10:45", "summary": "Cost control in the face of rising revenues is a key proof point of a successful turnaround of the Asia-focused bank. HSBC has made steady progress in its strategic overhaul during tough times. Rising rates are a boon, but also an important test, of management's newfound cost discipline."}, {"source": "wsj", "link": "https://www.wsj.com/articles/dwac-virgin-galactic-exxon-mobil-draftkings-what-to-watch-when-the-stock-market-opens-today-11645531045", "title": "DWAC, Virgin Galactic, Exxon Mobil, DraftKings: What to Watch in the Stock Market Today", "date": "2022-02-22 09:40", "summary": "Donald Trump's social-media platform went live in the U.S.; Virgin Galactic is due to report results. Wall Street stocks fell in morning trading after Russian President Vladimir Putin ordered the deployment of troops to contested regions of Ukraine. Here's what we're watching in Tuesday's trading:"}, {"source": "wsj", "link": "https://www.wsj.com/articles/chinese-tutoring-companies-take-big-financial-hit-amid-crackdown-11645534566", "title": "Chinese Tutoring Companies Take Big Financial Hit Amid Crackdown", "date": "2022-02-22 07:56", "summary": "New Oriental, TAL and Gaotu Techedu post heavy losses after Beijing banned for-profit tutoring for most school-age children. Three U.S.-listed Chinese education companies reported heavy losses after Beijing banned for-profit tutoring for most school-age children, showing the large financial toll of the crackdown on the industry last summer."}, {"source": "wsj", "link": "https://www.wsj.com/articles/rising-rates-hit-munis-11645500517", "title": "Rising Rates Hit Municipal Bonds", "date": "2022-02-22 07:00", "summary": "Worries about Federal Reserve interest-rate increases hit state and local debt, even as concerns about municipal finances retreat. Municipal-bond investors spent more than a decade fretting about state and local government finances. Now they are worried about interest rates."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hsbcs-profit-surges-but-bank-takes-hit-from-china-property-11645507783", "title": "HSBC's Profit Surges, but Bank Takes Hit From China Property", "date": "2022-02-22 06:55", "summary": "London-based bank plans further $1 billion buyback. HSBC Holdings PLC reported its highest annual net profit since 2018 and said rising interest rates were likely to boost future returns, even as the banking giant took a charge against potential fallout from the stress in China's property market."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chinese-banks-in-two-key-cities-cut-mortgage-rates-to-boost-housing-sector-11645530737", "title": "Chinese Banks in Two Key Cities Cut Mortgage Rates to Boost Housing Sector", "date": "2022-02-22 06:52", "summary": "Cuts in Shanghai and Guangzhou, though modest, follow similar steps by dozens of smaller cities as home prices and sales weaken. HONG KONG-Two of China's largest and most prosperous cities have cut interest rates for prospective home buyers, joining an effort to prop up a housing sector whose weakness could threaten the broader economy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sofi-to-buy-banking-infrastructure-firm-technisys-for-about-1-1-billion-11645524001", "title": "SoFi to Buy Technisys for About $1.1 Billion", "date": "2022-02-22 05:00", "summary": "The all-stock deal is CEO Anthony Noto's latest move to turn the onetime student lender into a full-service bank. SoFi Technologies Inc. is buying banking-software maker Technisys SA for about $1.1 billion, the latest in a string of deals designed to transform the lender into a one-stop financial shop."}]