[{"source": "wsj", "link": "https://www.wsj.com/articles/sec-probes-trading-by-elon-musk-and-brother-in-wake-of-tesla-ceos-sales-11645730528", "title": "SEC Probes Trades by Elon Musk and His Brother", "date": "2022-02-24 18:57", "summary": "Investigation looks partly at Kimbal Musk's trades before brother's pledge to sell based on Twitter poll. WASHINGTON-The Securities and Exchange Commission is investigating whether recent stock sales by Tesla Inc. Chief Executive Elon Musk and his brother, Kimbal Musk, violated insider-trading rules, according to people familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/carvana-buys-used-car-auction-network-as-growth-slows-11645745528", "title": "Carvana Buys Used-Car Auction Network as Growth Slows", "date": "2022-02-24 18:32", "summary": "Online auto dealer posts loss but says deal for ADESA will boost sales. Online auto dealer Carvana Co. said Thursday it would buy used-car auction business ADESA U.S. for $2.2 billion. The deal for the second-largest U.S. physical used-car auction network will help Carvana boost the number of cars it can sell."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-02-24-2022-11645676676", "title": "Stocks End Higher After New Russian Sanctions Announced", "date": "2022-02-24 18:13", "summary": "Major indexes recover after invasion of Ukraine sends stocks lower and oil above $100 a barrel. U.S. stocks fluctuated wildly Thursday, starting the day with a sharp drop and then recovering as investors piled into growth and technology stocks in the wake of Russia's invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/punishing-putin-through-banking-system-is-thorny-11645730184", "title": "Punishing Putin Through Swift Is Thorny", "date": "2022-02-24 17:44", "summary": "Financial sanctions hitting Russian banks are hard to coordinate and threaten wider economic blowback. As the U.S. and Europe weigh how to respond to Russia sending troops into Ukraine, financial sanctions are prime among those measures."}, {"source": "wsj", "link": "https://www.wsj.com/articles/healthcare-realty-trust-nears-deal-with-healthcare-trust-of-america-11645741490", "title": "Healthcare Realty Trust Nears Deal With Healthcare Trust of America", "date": "2022-02-24 17:37", "summary": "Cash-and-stock deal could be finalized within days, sources say. Healthcare Trust of America Inc., which owns and operates medical-office buildings around the country, is in advanced talks to combine with smaller rival Healthcare Realty Trust Inc. in a deal that could create a company worth more than $10 billion."}, {"source": "wsj", "link": "https://www.wsj.com/articles/coinbase-profit-quadruples-during-bitcoins-wild-rally-and-selloff-11645738014", "title": "Coinbase Profit Surges During Bitcoin's Wild Rally and Selloff", "date": "2022-02-24 17:31", "summary": "Company's earnings reflect boost in trading of cryptocurrencies. Coinbase Global Inc.'s fourth-quarter income more than quadrupled as the largest U.S. cryptocurrency exchange benefited from a manic quarter that saw bitcoin set a record before dropping sharply."}, {"source": "wsj", "link": "https://www.wsj.com/articles/what-russias-invasion-of-ukraine-means-for-investors-11645720181", "title": "What Russia's Invasion of Ukraine Means for Investors", "date": "2022-02-24 17:16", "summary": "Investors should pay close attention to the long-run trends that Russia's attack will intensify. Legendary banker Nathan Mayer Rothschild's supposed advice in the Napoleonic wars was to \"buy when there's blood in the streets.\" It proved right when Russia seized Crimea in 2014, with Russian stocks in ruble terms soaring for nearly eight years."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraines-fog-of-war-reaches-central-banks-11645710747", "title": "Ukraine's Fog of War Reaches Central Banks", "date": "2022-02-24 16:57", "summary": "While the direct spillovers from Russia's invasion for the broader European economy are few, the jump in energy prices is causing markets to fret about stagflation. Russia and Ukraine may not have strong ties to the global economy, but investors are already betting that a disruption in energy supplies will result in higher inflation, weaker growth and a devilishly difficult task for central banks."}, {"source": "wsj", "link": "https://www.wsj.com/articles/wayfair-braces-for-pandemic-fueled-online-shopping-spree-to-slow-down-11645725280", "title": "Wayfair Braces for Pandemic-Fueled Online Shopping Spree to Slow", "date": "2022-02-24 16:55", "summary": "Active customer numbers have dropped about 13% as executives say people are returning to physical stores. Wayfair Inc. is grappling not only with inflation denting consumers' spending power, but also people shifting their purchases to physical stores as Covid-19 pandemic restrictions ease."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-attack-on-ukraine-sends-oil-prices-above-100-a-barrel-for-first-time-since-2014-crash-11645681439", "title": "Oil Prices Surge Above $100 a Barrel After Russia Invades Ukraine", "date": "2022-02-24 16:49", "summary": "Military operation sparks worry over disruption to Russian exports of energy, metals and other commodities. LONDON-A global oil benchmark surged above $100 a barrel for the first time since 2014, and prices for natural gas, metals and grains, feedstocks for the global economy, vaulted higher after Russia's invasion of Ukraine snarled resource exports from the region."}, {"source": "wsj", "link": "https://www.wsj.com/articles/justice-department-sues-to-block-unitedhealths-planned-buy-of-change-healthcare-11645719693", "title": "Justice Department Sues to Block UnitedHealth's Planned Buy of Change Healthcare", "date": "2022-02-24 16:44", "summary": "Antitrust lawsuit argues $13 billion tie-up would lead to higher costs. WASHINGTON-The Justice Department filed an antitrust lawsuit Thursday challenging UnitedHealth Group Inc.'s $13 billion acquisition of health-technology firm Change Healthcare Inc., arguing the tie-up would unlawfully reduce competition in markets for commercial insurance and the processing of claims."}, {"source": "wsj", "link": "https://www.wsj.com/articles/treasury-yields-fall-after-russia-attacks-ukraine-11645719422", "title": "Treasury Yields Fall After Attack on Ukraine", "date": "2022-02-24 16:23", "summary": "Investors take measure of how conflict might affect economic growth. U.S. government bond yields fell Thursday as investors sought out haven assets following the Russian attack on Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/l-catterton-hires-goldman-morgan-stanley-for-possible-summer-ipo-11645736181", "title": "L Catterton Hires Goldman, Morgan Stanley for Possible Summer IPO", "date": "2022-02-24 16:03", "summary": "Bernard Arnault-backed private-equity firm could be valued at $3 billion, according to people familiar with the matter. L Catterton is planning an IPO, people familiar with the matter said, seeking to take advantage of surging investor interest in private equity."}, {"source": "wsj", "link": "https://www.wsj.com/articles/former-amazon-worker-leading-staten-island-union-efforts-arrested-11645726397", "title": "Former Amazon Worker Leading Staten Island Union Efforts Arrested", "date": "2022-02-24 15:30", "summary": "NYPD arrested Christian Smalls, two current workers after receiving a trespassing complaint at the warehouse. A former Amazon.com Inc . employee who wants to unionize workers at the company's Staten Island warehouse was arrested Wednesday for trespassing at that facility, according to the New York Police Department."}, {"source": "wsj", "link": "https://www.wsj.com/articles/international-firms-in-ukraine-close-offices-factories-after-russia-attack-11645715103", "title": "Companies Close Ukraine Offices, Factories After Russia Attack", "date": "2022-02-24 14:58", "summary": "Carlsberg closes breweries, SAP shuts office, ArcelorMittal shutters mines, while others gird for the impact of further sanctions. Companies operating in Russia and Ukraine began putting into place contingency plans, as they confronted a host of challenges and sliding share prices following Moscow's attack."}, {"source": "wsj", "link": "https://www.wsj.com/articles/moderna-beats-profit-estimates-fueled-by-vaccine-sales-11645707646", "title": "Moderna Beats Profit Estimates, Fueled by Vaccine Sales", "date": "2022-02-24 14:55", "summary": "Drugmaker, whose stock has tumbled this year, is working on an Omicron-specific booster shot. Moderna Inc. posted better-than-expected profits for the last three months of 2021 as the company's Covid-19 vaccine continued to power its year-over-year growth, while executives mulled plans to roll out an additional booster shot."}, {"source": "wsj", "link": "https://www.wsj.com/articles/dish-network-customer-base-erodes-ahead-of-5g-deadline-11645730918", "title": "Dish Network Customer Base Erodes Ahead of 5G Deadline", "date": "2022-02-24 14:28", "summary": "Chairman Charlie Ergen says technical challenges have delayed work to roll out high-speed cellular connections across the country. Dish Network Corp. Chairman Charlie Ergen said unexpected technical issues have delayed the rollout of his company's new fifth-generation mobile network but vowed to have basic service ready before a government-ordered coverage deadline hits in June."}, {"source": "wsj", "link": "https://www.wsj.com/articles/alibabas-quarterly-profit-declines-but-revenue-rises-11645709547", "title": "Alibaba Posts Slowest Revenue Growth Since Going Public", "date": "2022-02-24 13:27", "summary": "Chinese e-commerce giant says it will focus on retaining users instead of seeking user expansion. Alibaba Group Holding Ltd. posted its slowest growth in quarterly revenue since it went public in 2014 and said it would focus on retaining users on its platforms rather than pursuing user expansion, marking a strategic shift for the Chinese e-commerce giant."}, {"source": "wsj", "link": "https://www.wsj.com/articles/publishers-move-to-abandon-google-supported-mobile-web-initiative-11645725640", "title": "Publishers Move to Abandon Google-Supported Mobile Web Initiative", "date": "2022-02-24 13:00", "summary": "Owners of the Verge and Bustle test alternatives to AMP framework, an effort they expect will generate more ad revenue. Several large online publishers are taking steps to abandon a program from Alphabet Inc.'s Google that was billed as a way to optimize readers' mobile-browsing experience, saying it generates less advertising revenue."}, {"source": "wsj", "link": "https://www.wsj.com/articles/covid-19-vaccine-booster-and-omicron-what-to-know-11623421703", "title": "Should You Get a Covid-19 Vaccine Booster Shot? What to Know", "date": "2022-02-24 12:54", "summary": "Questions and answers on issues such as how well boosters protect against the Omicron variant and who is eligible. Covid-19 boosters are available for all adults and teenagers in the U.S."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russias-ruble-stocks-crater-as-invasion-of-ukraine-draws-sanctions-11645715129", "title": "Russia's Ruble, Stocks Crater as Invasion of Ukraine Draws Sanctions", "date": "2022-02-24 12:45", "summary": "Central bank tapped its $600 billion-plus war chest to prop up the ruble and regulators banned short selling on the stock market. Russia's stock market and currency took historic blows in the wake of the invasion of Ukraine, signs that the threat of Western sanctions is inflicting an immediate, though hard to assess, impact on the nation's economy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/one-of-bostons-priciest-condos-lists-for-10-5-million-11645722330", "title": "One of Boston's Priciest Condos Lists for $10.5 Million", "date": "2022-02-24 12:05", "summary": "The 4,000-square-foot home has views of the Public Garden and comes with two covered parking spaces. An education researcher is listing his $10.5 million Boston condominium, one of the 10 most expensive listings on the market in the city, said listing agent Maureen O'Hara of Coldwell Banker Realty."}, {"source": "wsj", "link": "https://www.wsj.com/articles/as-ukraine-burns-europes-energy-options-look-limited-11645718093", "title": "As Ukraine Burns, Europe's Energy Options Look Limited", "date": "2022-02-24 10:54", "summary": "Europe will be able to manage a disruption to natural-gas flow through Ukraine. If Russia starts cutting off natural gas altogether, though, there isn't a whole lot the world can do to help. It is Ukraine that Russia is invading but, depending on the Kremlin's whims, the rest of Europe could be subject to war-like rationing of energy. Natural-gas prices in Europe-already painfully high-are headed higher still. How much can the rest of the world pitch in?"}, {"source": "wsj", "link": "https://www.wsj.com/articles/bud-brewer-buoyed-as-drinkers-return-to-bars-order-pricier-beers-11645715843", "title": "Bud Brewer Buoyed as Drinkers Return to Bars, Order Pricier Beers", "date": "2022-02-24 10:17", "summary": "Drinkers returning to bars help AB InBev post better-than-expected earnings. Budweiser brewer Anheuser-Busch InBev SA reported higher fourth-quarter sales, buoyed by drinkers returning to bars and reaching for pricier beers."}, {"source": "wsj", "link": "https://www.wsj.com/articles/mortgage-rates-hover-near-4-stressing-buyers-before-spring-selling-season-11645715111", "title": "Mortgage Rates Hover Near 4%, Stressing Buyers Before Spring Selling Season", "date": "2022-02-24 10:05", "summary": "Average rate of 30-year fixed loan remains near highest level in three years. Mortgage rates hovered just below 4% for a second week, maintaining stress on potential buyers facing high prices and low inventory."}, {"source": "wsj", "link": "https://www.wsj.com/articles/northrop-grumman-occidental-petroleum-coinbase-fubotv-apple-what-to-watch-when-the-stock-market-opens-today-11645704179", "title": "Occidental Petroleum, Coinbase, fuboTV, Apple: What to Watch in the Stock Market Today", "date": "2022-02-24 09:45", "summary": "Defense stocks were climbing after Russia invaded Ukraine; Coinbase is due to report after the close. Wall Street stocks and global indexes moved sharply lower after Russia's invasion of Ukraine sent investors rushing for safety. Russia's MOEX stock benchmark dropped 37%. Here's what we're watching on Thursday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/citadel-is-further-paring-back-2-billion-melvin-investment-11645710666", "title": "Citadel Is Further Paring Back $2 Billion Melvin Investment", "date": "2022-02-24 08:51", "summary": "Citadel also redeemed half its investment in the hedge fund in 2021. Citadel LLC is further paring back its $2 billion investment in Melvin Capital Management after the hedge fund stumbled in its effort to recover from a near collapse triggered by surges in GameStop Corp. and other \"meme stocks\" early last year."}, {"source": "wsj", "link": "https://www.wsj.com/articles/jared-kushners-new-fund-looks-to-profit-from-his-middle-east-diplomacy-11645709017", "title": "Kushner's New Fund Looks to Profit From His Diplomacy", "date": "2022-02-24 08:23", "summary": "One pitch to a bank included slide listing Abraham Accords, Israeli-Palestinian peace initiative and trade deals involving North America and China. RIYADH, Saudi Arabia-Jared Kushner has toured Persian Gulf monarchies with a pitch for his new $3 billion fund: Get a piece of deals made possible by Trump administration diplomatic initiatives such as the Abraham Accords, which forged Israeli relations with several Arab states."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-green-investors-are-buying-dirty-coal-11645699973", "title": "Why Green Investors Are Buying Dirty Coal", "date": "2022-02-24 05:52", "summary": "Traditional power companies are hardly market darlings right now-and that is resulting in some interesting takeover bids. Big carbon emitters have been shunned by the market in recent years. Ironically, that is making environmentally conscious investors more interested in them."}, {"source": "wsj", "link": "https://www.wsj.com/articles/a-boardroom-battle-at-aerojet-rocketdyne-clouds-the-pentagon-suppliers-future-11645698600", "title": "Aerojet Boardroom Battle Clouds the Pentagon Supplier's Future", "date": "2022-02-24 05:30", "summary": "Chairman and CEO are at odds, as crucial rocket-engine maker charts course after sale to Lockheed Martin collapsed. A boardroom battle at Aerojet Rocketdyne Holdings Inc. is playing out in lawsuits and clouding the future of the U.S. rocket engine maker, after the collapse of its planned $4.4 billion sale to Lockheed Martin Corp."}, {"source": "wsj", "link": "https://www.wsj.com/articles/blackrock-warner-music-invest-750-million-in-female-and-diverse-artists-11645696801", "title": "BlackRock, Warner Music Invest $750 Million in Female and Diverse Artists", "date": "2022-02-24 05:00", "summary": "The companies seek stakes in newer music copyrights in partnership with Influence Media. BlackRock Inc. and Warner Music Group Corp. have invested $750 million in a fund to amass music-rights catalogs from female and diverse artists, according to people familiar with the deal."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hong-kong-exchanges-touts-ipo-backlog-after-record-annual-profit-11645694605", "title": "Hong Kong Exchanges Touts IPO Backlog After Record Annual Profit", "date": "2022-02-24 04:23", "summary": "IPOs raised the equivalent of $42.5 billion last year, though nearly two-thirds of that came in the first half. Hong Kong's stock-exchange operator reported record annual profit for 2021, boosted by a flurry of Chinese listings, and despite a steep drop-off in share sales and stock trading in the second half of the year."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-attack-on-ukraine-threatens-european-gas-supplies-11645679190", "title": "Russia Attack on Ukraine Threatens European Gas Supplies", "date": "2022-02-24 03:22", "summary": "Already suffering high prices, Europe must now contend with risks to Ukrainian infrastructure. Natural-gas prices rose around the world as Russia's new military push against Ukraine posed a threat to Europe's already tenuous supply of the vital heating and power-generation fuel."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-crisis-has-big-western-businesses-girding-for-fallout-from-sanctions-11645619447", "title": "Russia-Ukraine Crisis Has Western Companies Bracing for Sanctions Hit", "date": "2022-02-24 22:53", "summary": "Carlsberg, BP, Exxon Mobil, ArcelorMittal and others with operations in Russia and Ukraine weigh contingencies and impact of sanctions. Western companies with operations in Russia and Ukraine are girding for the potential impact of fresh sanctions after Russian President Vladimir Putin announced a military operation in Ukraine's eastern Donbas region."}, {"source": "wsj", "link": "https://www.wsj.com/articles/eu-to-sanction-russian-defense-minister-internet-research-agency-11645615176", "title": "U.S., Europe Ramp Up Sanctions on Russia", "date": "2022-02-24 20:46", "summary": "The initial measures are aimed at penalizing Putin while also curtailing any further military ambitions in Ukraine. The Biden administration said it would impose sanctions on the company behind the Nord Stream 2 natural-gas pipeline while the European Union sanctioned Russian Defense Minister Sergei Shoigu, the country's Internet Research Agency and several other high-profile Russian officials."}]