[{"source": "wsj", "link": "https://www.wsj.com/articles/target-profit-rises-as-annual-revenue-crosses-100-billion-11646134269", "title": "Target Profit Rises as Annual Revenue Crosses $100 Billion", "date": "2022-03-01 18:59", "summary": "Retailer expects sales growth to slow in 2022. After a two-year pandemic run that brought Target Corp. billions in sales, the retailer wants to keep growing by building more stores and e-commerce hubs and new lines of business."}, {"source": "wsj", "link": "https://www.wsj.com/articles/movies-concerts-and-sports-give-russia-cold-shoulder-11646170162", "title": "Movies, Concerts and Sports Give Russia Cold Shoulder", "date": "2022-03-01 18:18", "summary": "Netflix, Disney are among entertainment providers to show opposition to invasion of Ukraine by pulling back from Russian market. The entertainment industry is turning its back on Russia."}, {"source": "wsj", "link": "https://www.wsj.com/articles/scooter-braun-talent-manager-who-discovered-justin-bieber-sells-austin-home-to-blockchain-mogul-for-around-18-million-11646176377", "title": "Scooter Braun, Talent Manager Who Discovered Justin Bieber, Sells Austin Home for Around $18 Million", "date": "2022-03-01 18:12", "summary": "Mr. Braun, also known for battle with Taylor Swift, recently paid more than $62 million for a mansion in Los Angeles. Celebrity talent manager Scooter Braun has quietly sold a waterfront home in Austin, Texas, for around $18 million, according to a person familiar with the deal."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-etfs-offer-hint-of-where-the-moscow-exchange-is-headed-11646155661", "title": "Russian ETFs Offer Hint of Where the Moscow Exchange Is Headed", "date": "2022-03-01 17:41", "summary": "Two slumping exchange-traded funds offer a glimpse of what may lie ahead for Russia's stock market once it reopens. Money managers are taking extraordinary steps to steady exchange-traded funds exposed to Russia."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-03-01-2022-11646124157", "title": "Stocks Fall, Oil Again Tops $100 Amid Sanctions", "date": "2022-03-01 17:31", "summary": "Bitcoin, gold rise; Treasury yields fall with safe-harbor assets in demand. U.S. stock indexes fell and bond yields slipped Tuesday while oil prices rose to multiyear highs, as Russia's invasion of Ukraine continued to whipsaw through markets."}, {"source": "wsj", "link": "https://www.wsj.com/articles/abbott-recalls-more-baby-formula-after-another-infant-dies-11646173115", "title": "Abbott Recalls More Baby Formula", "date": "2022-03-01 17:18", "summary": "Company adds another lot of Similac to its recall list as the FDA investigates several infant hospitalizations and two deaths. Abbott Laboratories is expanding its previously announced recall of baby formula after being informed of the death of another infant who consumed the company's product."}, {"source": "wsj", "link": "https://www.wsj.com/articles/salesforce-sales-rise-as-demand-for-cloud-services-continues-11646172973", "title": "Salesforce Sales Rise as Demand for Cloud Services Continues", "date": "2022-03-01 17:16", "summary": "The business software company raised its sales outlook for the year after a better-than-expected quarter. Business software provider Salesforce.com Inc . logged higher revenue in the fourth quarter and raised its annual sales outlook, as the company looks to maintain its leadership role in cloud-based services that have expanded in response to the Covid-19 pandemic."}, {"source": "wsj", "link": "https://www.wsj.com/articles/california-home-next-to-kevin-costners-lists-for-109-million-11646171447", "title": "California Home Next to Kevin Costner's Lists for $109 Million", "date": "2022-03-01 16:50", "summary": "The Santa Barbara-area property has a private beach. Perched above the Pacific Ocean, a California ranch estate with a private beach is coming on the market for $109 million."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-scrambles-to-maintain-oil-sales-life-blood-of-economy-11646156655", "title": "Russia Scrambles to Maintain Oil Sales, Lifeblood of Economy", "date": "2022-03-01 16:42", "summary": "Refiners balk at buying Russia's oil and banks refuse to finance shipments of Russian commodities, fearing the impact of financial sanctions. In their broadside of sanctions on Russia, the U.S. and its allies are going out of their way to spare energy shipments and keep economies humming and voters warm."}, {"source": "wsj", "link": "https://www.wsj.com/articles/jeep-plans-fully-electric-lineup-by-2025-11646152883", "title": "Jeep Plans Line of Fully Electric SUVs", "date": "2022-03-01 16:39", "summary": "Global auto maker plans to double revenue by 2030, sustain double-digit operating margins, CEO says. Jeep, a historic American brand that has long been known for its rugged sport-utility vehicles, plans to offer a line of fully electric SUVs in the coming years, as part of a broader strategic road map unveiled Tuesday by parent company Stellantis NV."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-consumers-cut-off-from-many-foreign-purchases-11646154897", "title": "Russian Consumers Cut Off From Many Foreign Purchases", "date": "2022-03-01 16:28", "summary": "The ways Russians can pay for goods and services is being disrupted. Moves to unplug Russia from the international financial system have cut many of the country's citizens off from the global, digital economy, but noncash payments haven't ground completely to a halt."}, {"source": "wsj", "link": "https://www.wsj.com/articles/slot-machine-developer-scientific-games-to-change-name-to-light-wonder-11646168400", "title": "Scientific Games to Change Name to Light & Wonder", "date": "2022-03-01 16:00", "summary": "New name reflects Las Vegas company's shifting focus to online gambling content. Slot-machine and game developer Scientific Games Corp. said it plans to rebrand as Light & Wonder Inc. after the company shed its lottery and sports-betting businesses to focus on content for casinos and online gambling."}, {"source": "wsj", "link": "https://www.wsj.com/articles/target-keeps-hitting-the-mark-11646167890", "title": "Target Keeps Hitting the Mark", "date": "2022-03-01 15:51", "summary": "Retailer's long-term guidance is surprisingly bullish after two years of breakneck growth. Target has taken a victory lap around the grocery, clothing and home aisles over the past two years. How much faster can it run?"}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-races-to-protect-financial-system-from-barrage-of-sanctions-11646149057", "title": "Russia Races to Protect Financial System From Barrage of Sanctions", "date": "2022-03-01 15:41", "summary": "Stock trading remains halted and Moscow has announced new measures to protect economy. Russia sifted through the financial wreckage caused by Western sanctions, as its stock market remained closed and the government announced new measures to try to limit the damage to the economy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/fallout-from-judges-financial-conflicts-spreads-to-appeals-courts-11646155384", "title": "Fallout From Judges' Financial Conflicts Spreads to Appeals Courts", "date": "2022-03-01 15:04", "summary": "Cases involving StarKist, Bank of America and Cisco are among those reviewed. Fallout from federal judges violating financial-conflict laws is spreading to appeals courts across the nation."}, {"source": "wsj", "link": "https://www.wsj.com/articles/dominos-ceo-ritch-allison-to-retire-11646146208", "title": "Domino's Pizza New CEO Faces Menu of Challenges", "date": "2022-03-01 14:34", "summary": "Incoming CEO Russell Weiner to hunt for more pizza drivers, change value deal. Domino's Pizza Inc. is promoting its chief operating officer to chief executive as the chain struggles with staffing and equipment shortages that are hurting its ability to deliver pizzas and build new U.S. stores."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-wars-impact-on-manufacturers-is-foggy-11646162937", "title": "Ukraine War's Impact on Manufacturers Is Foggy", "date": "2022-03-01 14:28", "summary": "With Covid-19 strains fading, manufacturers face new and unpredictable complications following Russia's invasion and Western sanctions. Manufacturers' supply-chain problems looked as if they were set to start easing this year. Russia's invasion of Ukraine could throw a wrench into that process, but good luck figuring out what the actual outcome will be."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-panel-finds-no-national-security-concerns-with-chinese-plane-deal-11646158527", "title": "U.S. Panel Finds No National-Security Concerns With Chinese Plane Deal", "date": "2022-03-01 13:15", "summary": "American shareholders in Icon Aircraft had alleged improper tech transfer to China and urged U.S. investment-screening panel Cfius to intervene. A U.S. investment-screening panel has concluded its review of a Chinese firm's nearly 47% stake in a U.S. aircraft startup, determining there are \"no unresolved national security concerns\" with the deal, according to a letter reviewed by The Wall Street Journal."}, {"source": "wsj", "link": "https://www.wsj.com/articles/novavax-lucid-zoom-video-barrick-gold-amc-what-to-watch-when-the-stock-market-opens-today-11646135912", "title": "Novavax, Lucid, Zoom Video, AMC, Target: What to Watch in the Stock Market Today", "date": "2022-03-01 09:37", "summary": "Lucid cut its 2022 vehicle-production target; AMC Entertainment is due to report results. Wall Street stocks wavered following days of whipsaw moves, while oil prices rallied. Here's what we're watching in Tuesday's trading:"}, {"source": "wsj", "link": "https://www.wsj.com/articles/can-russias-sanctions-pain-be-chinas-gain-11646144467", "title": "Can Russia's Sanctions Pain Be China's Gain?", "date": "2022-03-01 09:26", "summary": "Concerted Western action has set a tough precedent for any potential future crisis in the Taiwan Strait. What does the Russia-Ukraine conflict, and the surprisingly strong Western response look like from Beijing? Potentially a boon over the long run on the energy front, but deeply worrying financially."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-war-in-ukraine-could-feed-through-to-breakfast-11646142867", "title": "How War in Ukraine Could Feed Through to Breakfast", "date": "2022-03-01 08:54", "summary": "If conflict with Russia disrupts the nation's vast agricultural harvests, consumers already paying more for food will face a fresh inflation bout. Even in countries far away from Ukraine, consumers could feel the impact of war at mealtimes. After two years of supply-chain issues, global food companies have few tools left to shield shoppers from further rises in their grocery bills."}, {"source": "wsj", "link": "https://www.wsj.com/articles/war-in-ukraine-disrupts-ships-around-the-globe-11646138737", "title": "War in Ukraine Disrupts Ships Around the Globe", "date": "2022-03-01 08:36", "summary": "Maersk and MSC, the world's biggest container ship operators, suspend cargo services to Russian ports. The world's biggest container ship operators-A.P. Moller-Maersk A/S and Mediterranean Shipping Co.-said they would temporarily suspend services to Russian ports, including those far from the conflict in Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/reddit-traders-took-space-stocks-to-the-moon-re-entry-could-be-ugly-11645785002", "title": "Reddit Traders Took Space Stocks to the Moon. Re-Entry Could Be Ugly.", "date": "2022-03-01 08:31", "summary": "Startups with realistic ambitions stand a better chance as a bubble that lifted up space stocks deflates. Amateur Reddit traders managed to launch the space economy into orbit last year. It is time to see which stocks can survive re-entry."}, {"source": "wsj", "link": "https://www.wsj.com/articles/toyota-shutdown-over-cyberattack-at-supplier-reflects-cautious-culture-11646141165", "title": "Toyota Shutdown Over Cyberattack at a Supplier Reflects Cautious Culture", "date": "2022-03-01 08:26", "summary": "Production in Japan to resume Wednesday after car maker hits stop button over malicious virus in supplier's computers. TOKYO- Toyota Motor Corp.'s Japan factories were set to reopen Wednesday morning after a one-day shutdown that reflected the company's culture of caution."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hong-kongs-covid-19-measures-pressure-finance-in-asian-financial-hub-11646130602", "title": "Hong Kong's Covid Measures Pressure Finance in Asian Financial Hub", "date": "2022-03-01 07:22", "summary": "Some professionals ask employers whether they can relocate, while a few foreigners decide to resign and move home. Hong Kong's most recent measures to combat Covid-19 are unsettling its large community of bankers and investors, many of whom were already struggling to square business and family commitments with severely curtailed travel."}, {"source": "wsj", "link": "https://www.wsj.com/articles/opendoor-got-flipped-by-zillows-wake-11646134201", "title": "Opendoor Got Flipped by Zillow's Wake", "date": "2022-03-01 06:30", "summary": "Investors got spooked when the residential-property home flipper said its fourth-quarter contribution margin was down. This supposed ten-bagger now has twice the upside. But it may have twice the risk, too."}, {"source": "wsj", "link": "https://www.wsj.com/articles/companies-see-an-opening-for-office-reopening-11646130602", "title": "Companies Seize On March as a Moment to Reopen the Office", "date": "2022-03-01 05:30", "summary": "With Omicron cases falling, Citi, American Express, Cisco Systems and others say they spot a window to bring workers back together. The office return is in motion."}, {"source": "wsj", "link": "https://www.wsj.com/articles/toshiba-replaces-ceo-again-but-sticks-with-two-way-split-plan-11646108949", "title": "Toshiba Replaces CEO Again but Sticks With Two-Way-Split Plan", "date": "2022-03-01 03:49", "summary": "Former Siemens executive takes over at Japanese industrial conglomerate. TOKYO-Toshiba Corp.'s chief executive stepped down Tuesday, but the company said it would stick with its plan to split into two parts, which some foreign shareholders oppose."}, {"source": "wsj", "link": "https://www.wsj.com/articles/toyota-to-shut-down-all-japan-plants-tuesday-11646050217", "title": "Toyota Shuts Japan Plants for One Day After Supplier's Computer Virus", "date": "2022-03-01 23:23", "summary": "Supplier Kojima said it couldn't get its systems in place to work with customers properly on Tuesday. TOKYO- Toyota Motor Corp. on Tuesday shut down all 14 of its factories in Japan after a supplier suffered a computer-virus attack, but the company said the factories would reopen Wednesday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/netflix-wont-add-russian-channels-to-service-defying-new-regulation-11646076964", "title": "Netflix Won't Add Russian Broadcasters to Service", "date": "2022-03-01 21:35", "summary": "Russian rule requires services with more than 100,000 subscribers to carry some 20 Russian channels. Netflix Inc. said it has no plans to add any Russian channels to its service in Russia despite a regulation that would require the streaming giant to carry several state-run broadcasters."}, {"source": "wsj", "link": "https://www.wsj.com/articles/billionaire-richard-lis-fwd-files-for-hong-kong-ipo-11646060032", "title": "Richard Li's FWD Files for Hong Kong IPO", "date": "2022-03-01 20:37", "summary": "Pan-Asian insurer is said to be looking to raise about $1 billion. "}]