[{"source": "wsj", "link": "https://www.wsj.com/articles/nbc-draws-lowest-olympics-ratings-ever-with-beijing-games-11645487782", "title": "NBC Draws Lowest Olympics Ratings Ever", "date": "2022-02-21 18:56", "summary": "TV viewership dropped 42% from 2018; 'This was probably the most difficult Olympics of all time'. The Beijing Winter Olympic Games drew the smallest average U.S. prime-time audience ever recorded for the Olympics since NBCUniversal began broadcasting the event decades ago."}, {"source": "wsj", "link": "https://www.wsj.com/articles/frackers-push-into-once-dead-shale-patches-as-oil-nears-100-a-barrel-11645439400", "title": "Frackers Push Into Once-Dead Shale Patches as Oil Nears $100 a Barrel", "date": "2022-02-21 16:29", "summary": "Oil producers drill in less-desirable areas like Anadarko Basin of Oklahoma and DJ Basin of Colorado, where activity virtually stopped during pandemic. Spurred by the highest oil prices in years, shale companies are moving drilling rigs back into oil fields that were all but abandoned a few years ago."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-02-21-2022-11645432495", "title": "Russian Stocks, Ruble, Lead Global Markets Down, While Oil Rises Amid Ukraine Tensions", "date": "2022-02-21 15:33", "summary": "Russia's benchmark stock index posts biggest daily percentage decline since March 2014. Russian stocks, the ruble and European shares tumbled while oil prices rose as investors grew nervous at signs of escalation between Moscow and the West."}, {"source": "wsj", "link": "https://www.wsj.com/articles/lycra-the-stretchy-fiber-maker-targeted-by-creditors-of-chinese-textile-group-11645469195", "title": "Lycra Targeted by Creditors of Chinese Textile Group", "date": "2022-02-21 13:46", "summary": "Four creditors of textile-and-fashion giant Shandong Ruyi seek control of company, citing 2019 loan. Creditors of textile and fashion conglomerate Shandong Ruyi Technology Group Co. said that the Chinese company defaulted on a loan used to buy Lycra Co. and that they would seek to gain control of the stretchy-fabric maker."}, {"source": "wsj", "link": "https://www.wsj.com/articles/yale-law-school-to-cover-full-tuition-and-fees-for-lowest-income-students-11645468500", "title": "Yale Law School to Cover Full Tuition and Fees for Lowest-Income Students", "date": "2022-02-21 13:35", "summary": "Dean Heather Gerken urges other law schools to direct more of their financial aid to need-based scholarships. Yale Law School will begin covering full tuition for its lowest-income students next fall, as the elite graduate program aims to diversify its ranks and make obtaining a law degree more affordable."}, {"source": "wsj", "link": "https://www.wsj.com/articles/workplace-technology-wed-like-to-see-11645364958", "title": "Workplace Technology We'd Like to See", "date": "2022-02-21 12:00", "summary": "Journal readers and workplace experts imagine tech products and innovations that would make their work easier and more productive. If there's a universal truth about workplace technology it's this: We love to complain about it. We complain about how it does what it does, and we complain about how it doesn't do what we need it to do. We gripe that it too often fails to deliver on its promise, and that it then creates new problems."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chicken-industry-officials-prepare-for-retrial-in-price-fixing-case-11645459200", "title": "Chicken Industry Officials Prepare for Retrial in Price-Fixing Case", "date": "2022-02-21 11:00", "summary": "Former Pilgrim's Pride CEOs, other executives face charges in Justice Department's probe of poultry industry. New trial starts Tuesday.. Executives who worked for some of the biggest U.S. chicken producers are set to stand trial for a second time beginning Tuesday, as they battle Justice Department accusations that they conspired to fix prices."}, {"source": "wsj", "link": "https://www.wsj.com/articles/online-real-estate-isnt-worth-the-chance-11645455782", "title": "Online Real Estate Isn't Worth the Chance", "date": "2022-02-21 10:03", "summary": "Even as the housing market booms in the U.S., dreams of online real-estate riches have faded in the stock market. You can make a lot of money on physical real estate right now, but recent results from major online real-estate players show 2022 isn't the year to play Monopoly in the stock market."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-more-bosses-should-say-yes-when-employees-ask-for-special-deals-11645448400", "title": "Why More Bosses Should Say 'Yes' When Employees Ask for Special Deals", "date": "2022-02-21 08:00", "summary": "One-size-fits-all rules seem easier and fairer. But in reality, the opposite is often true.. Since the pandemic began, more employees want to be exceptions to the rule."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sofr-leads-race-to-replace-libor-as-interest-rate-benchmark-11645408905", "title": "SOFR Leads Race to Replace Libor as Benchmark Rate", "date": "2022-02-21 08:00", "summary": "Sales of corporate loans and derivatives tied to rate have picked up, with Crocs among recent issuers. U.S. companies and financial institutions are starting to settle on a new interest-rate benchmark to replace the troubled London interbank offered rate, which underpins trillions of dollars of financial contracts."}, {"source": "wsj", "link": "https://www.wsj.com/articles/tesla-planned-to-open-its-first-european-gigafactory-last-summer-its-still-waiting-11645439401", "title": "Tesla Planned to Open Its First European Gigafactory Last Summer. It's Still Waiting.", "date": "2022-02-21 05:30", "summary": "Late filing and environmental challenges keep Tesla waiting for green light to open plant near Berlin. BERLIN-When Rocco Pigola, a 59-year-old refinery worker from Bavaria who has owned six Tesla vehicles, heard about the electric-car maker's new plant near Berlin, he jumped at the opportunity to order a Model Y Performance."}, {"source": "wsj", "link": "https://www.wsj.com/articles/exodus-from-bond-funds-is-mitigating-the-stock-markets-swoon-11645439401", "title": "Exodus From Bond Funds Is Mitigating Stock Market's Swoon", "date": "2022-02-21 05:30", "summary": "Bond investors heading for the exits amid interest-rate concerns find few other alternatives to stocks. The bad news in the bond market has been a rare boon for stocks."}, {"source": "wsj", "link": "https://www.wsj.com/articles/meituan-shows-china-tech-isnt-delivering-yet-11645438728", "title": "Meituan Shows China Tech Isn't Delivering Yet", "date": "2022-02-21 05:18", "summary": "Investors were hoping for a reprieve from the regulatory crackdown that punished shares in 2021. Investors in Chinese technology stocks hoping to catch a break after last year's brutal crackdown are finding themselves dodging new curveballs instead."}, {"source": "wsj", "link": "https://www.wsj.com/articles/atlassian-co-founder-wants-to-buy-australias-biggest-polluter-to-make-it-greener-11645427453", "title": "Atlassian Co-Founder Wants to Buy Australia's Biggest Polluter to Make It Greener", "date": "2022-02-21 02:10", "summary": "AGL Energy rejects takeover proposal valued at more than $3.5 billion from Mike Cannon-Brookes and Canada's Brookfield Asset Management, who want to shut coal-fired power plants ahead of schedule. SYDNEY-Mike Cannon-Brookes thought Australia's biggest polluter wasn't doing enough to curb its greenhouse gas emissions, so he sought to buy the company."}]