[{"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-03-09-2022-11646814910", "title": "Stocks Rally, Oil Falls, Extending Volatility Amid Ukraine War", "date": "2022-03-09 16:03", "summary": "Oil falls, while European shares jump and Russia's stock market remains shut. U.S. stocks jumped and oil prices dropped Wednesday, extending a volatile spell as investors track the economic fallout of the war in Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/nickel-market-crisis-sends-london-metal-exchange-scrambling-to-prevent-damage-11646858558", "title": "Nickel Market Crisis Sends London Metal Exchange Scrambling to Prevent Damage", "date": "2022-03-09 15:42", "summary": "Chinese nickel giant at center of action, Tsingshan, received financial lifeline from banks to help meet margin calls related to $8 billion in paper losses. The metals industry, financial regulators and Chinese officials rushed to resolve a crisis in London's nickel market, which remained on ice after an ill-fated trade sparked mammoth price gains and billions of dollars of losses."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cnns-jeff-zucker-secured-bonus-payment-of-over-5-million-in-exit-deal-with-networks-parent-11646857055", "title": "CNN's Zucker Secured Bonus Payment of Over $5 Million in Exit Deal", "date": "2022-03-09 15:17", "summary": "Mr. Zucker, who resigned last month citing his failure to report consensual relationship with colleague, waived rights to sue CNN parent WarnerMedia as part of pact. Upon his departure from CNN, former president Jeff Zucker reached an exit deal with the network's parent entitling him to a payment of over $5 million, compensation he was owed from his 2021 bonus, according to people familiar with the situation."}, {"source": "wsj", "link": "https://www.wsj.com/articles/campbell-soup-sales-fall-on-labor-supply-constraints-11646831651", "title": "Campbell Soup Sales Fall on Labor, Supply Constraints", "date": "2022-03-09 13:33", "summary": "Food company says it is seeing the labor market improve and expects its price increases to better mitigate inflation. Campbell Soup Co. posted lower quarterly sales as labor and supply constraints weighed on operations and profitability."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-workers-are-quitting-their-jobs-higher-paychecks-promotions-great-resignation-11646838499", "title": "Workers Who Quit Jobs Report Finding Better Pay and Career Prospects", "date": "2022-03-09 13:08", "summary": "Higher salaries and the chance to advance beat out remote work, flexible hours and child care as top reason employees left roles last year, new data show. Over the last year, millions of workers have quit their jobs because of burnout, bad hours and a desire for more flexibility. But higher paychecks and a better shot at advancing professionally are the main motivations for leaving, a new study from the Pew Research Center shows."}, {"source": "wsj", "link": "https://www.wsj.com/articles/there-will-never-be-enough-workers-11646848256", "title": "There Will Never Be Enough Workers", "date": "2022-03-09 12:50", "summary": "Even if all the people who left the job market during the pandemic come back, employers are still going to struggle to find employees. There are millions of jobs available in the U.S. Most of them will probably never be filled."}, {"source": "wsj", "link": "https://www.wsj.com/articles/amazon-flagged-to-justice-department-for-possible-criminal-obstruction-of-congress-11646827200", "title": "Amazon Flagged to DOJ for Possible Obstruction of Congress", "date": "2022-03-09 11:49", "summary": "House Judiciary Committee accuses tech giant of withholding information during antitrust probe; Amazon has denied any attempts to mislead. A U.S. congressional committee is asking the Justice Department to investigate Amazon.com Inc. and some of its executives for what lawmakers say is potentially criminal obstruction of Congress, according to people familiar with the matter and a letter containing the request."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sec-considers-rule-requiring-firms-to-report-cyber-attacks-within-four-days-11646838001", "title": "SEC Plan Would Require Report of Cyberattacks Within Four Days", "date": "2022-03-09 11:34", "summary": "Regulator offers rule that would mandate reporting of ransomware incidents and data breaches. WASHINGTON-Federal regulators are considering a requirement that publicly traded companies disclose data breaches and other significant cybersecurity incidents within four days, as they seek to strengthen financial markets' resilience to online attacks."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-resources-fuel-clean-energy-too-11646842303", "title": "Russian Resources Fuel Clean Energy, Too", "date": "2022-03-09 11:11", "summary": "Nickel's wild week is a reminder that high commodity prices aren't all good news for the renewable energy business. Nickel at $100,000 a ton is evidence of a financial squeeze more than one related to the underlying commodity. It still illustrates the risks associated with the bets on green energy now piling up in investors' brokerage accounts."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-does-the-u-s-still-buy-russian-oil-11646151935", "title": "How Much Oil Does the U.S. Import From Russia and Why Is Biden Banning It?", "date": "2022-03-09 11:08", "summary": "U.S. has turned to Russian crude to service more isolated coastal markets and keep refineries running at optimal levels. The fracking boom made America the world's biggest oil producer a few years ago, but the U.S. until recently was still importing millions of barrels each day from other parts of the world, including Russia."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-car-maker-known-for-cold-war-self-reliance-idles-factories-11646828796", "title": "Iconic Russian Car Maker, Known for Cold War Self-Reliance, Halts Production", "date": "2022-03-09 10:55", "summary": "Disruption shows how Russia's economy is beginning to feel the bite of Western sanctions. Lada cars have been a symbol of Russia's self-reliance since they began rolling off assembly lines during the depths of the Cold War."}, {"source": "wsj", "link": "https://www.wsj.com/articles/elizabeth-holmes-theranos-ceo-who-11641318330", "title": "Elizabeth Holmes: What Happens Next to Theranos Founder Found Guilty of Fraud", "date": "2022-03-09 10:36", "summary": "Holmes found guilty on four of 11 counts; sentencing set for September. Elizabeth Holmes, the founder of Theranos Inc., was found guilty Jan. 3 on four counts of criminal fraud against investors. She was acquitted on four counts tied to patients. The jury was unable to reach a unanimous verdict on the remaining three counts tied to investors."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cathay-pacific-revival-hopes-snuffed-out-by-hong-kongs-zero-covid-plan-11646839768", "title": "Cathay Pacific Revival Hopes Snuffed Out by Hong Kong's Zero-Covid Plan", "date": "2022-03-09 10:29", "summary": "Flag carrier's return to profit proves short-lived as new antivirus measures kick in. HONG KONG-Cathay Pacific Airways Ltd. returned to profit in the second half of last year after it axed staff, mothballed dozens of jets and shifted its focus to cargo. Hong Kong's flag carrier now expects to sink back into the red thanks to the city's tightening of zero-Covid policies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chinas-5-5-growth-target-is-a-big-reach-11646838977", "title": "China's 5.5% Growth Target Is a Big Reach", "date": "2022-03-09 10:16", "summary": "Russia's invasion of Ukraine and soaring oil prices are latest obstacle to hitting growth targets in pivotal year politically for Xi Jinping. By the standards of China's rip-roaring economic growth over the past 30 years, \"around 5.5%\"-the official target for 2022, released over the weekend-is positively leisurely."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-oil-ban-could-pinch-refiners-today-motorists-tomorrow-11646825581", "title": "Russian Oil Ban Could Pinch Refiners Today, Motorists Tomorrow", "date": "2022-03-09 10:13", "summary": "Russia accounts for a relatively small piece of U.S. oil and petroleum product imports. That doesn't mean it will be easy or cheap for American refiners to find replacement barrels.. In the scheme of things, President Biden's ban on Russian oil imports has more bark than bite. That doesn't mean it won't hurt some U.S. refiners."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-gas-prices-expensive-11646767172", "title": "Ukraine-Russia War Sparks Gas Price Increases Across U.S.", "date": "2022-03-09 09:39", "summary": "Invasion accelerates rise in already climbing prices; national average tops $4 a gallon. U.S. gasoline prices have reached records above $4 a gallon, a climb that threatens to hamper economic growth, lift already high inflation and cut down on summer road trips."}, {"source": "wsj", "link": "https://www.wsj.com/articles/frackers-say-bottlenecks-slow-them-from-ramping-up-as-oil-prices-soar-11646835536", "title": "Frackers Say Bottlenecks Impede Output Boost as Oil Prices Soar", "date": "2022-03-09 09:18", "summary": "Shale companies say they are trying to help to fill a gap in global oil supplies after Russia's attack on Ukraine, but wary investors, supply-chain issues crimp output. American shale drillers say there are limits to how much and how quickly they can boost shaky oil supplies following Russia's invasion of Ukraine, cautioning that supply-chain issues, investors wary of overspending, thinning inventories and other problems constrict growth."}, {"source": "wsj", "link": "https://www.wsj.com/articles/fidelity-investments-posts-record-revenue-on-stock-market-rally-11646834401", "title": "Fidelity Investments Posts Record Revenue on 2021's Market Rally", "date": "2022-03-09 09:00", "summary": "2021 marked the sixth straight year of record earnings for the privately held firm controlled by the Johnson family. Fidelity Investments said operating profit jumped 13% last year as an individual-investing boom and the stock market rally lifted the money-management giant's revenue to a record."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ride-hailers-must-decide-who-pays-up-to-gas-up-11646829180", "title": "Ride-Hailers Must Decide Who Pays to Gas Up", "date": "2022-03-09 07:33", "summary": "As gas prices continue to rise, ride-hailers must decide whether to slap their contractors or their customers with the tab. Rising gasoline prices could help or harm ride-hailers. It might depend on who they expect to pay the tab."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cross-border-travel-rebound-a-risk-for-card-stocks-11646827200", "title": "Cross-Border Travel Rebound a Risk for Card Stocks", "date": "2022-03-09 07:00", "summary": "Investors appear to be dialing back bets on a big uptick in lucrative cross-border travel volumes for cards. Many investors were betting on a rebound in global travel spending to propel some big payments stocks in 2022. They might need to be more cautious for now."}, {"source": "wsj", "link": "https://www.wsj.com/articles/tiktok-struggles-to-find-footing-in-wartime-11646827213", "title": "TikTok Struggles to Find Footing in Wartime", "date": "2022-03-09 07:00", "summary": "Short-video app faces one of its biggest challenges since its launch, as it grapples with heightened role in geopolitics. TikTok exploded as a social-media app with silly videos featuring lip-syncing, dance moves and practical jokes. Now some users are creating endless feeds of war memes and state propaganda that are influencing global perspectives on the conflict in Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/pfizer-starts-testing-its-covid-19-pill-in-children-11646826300", "title": "Pfizer Starts Testing Its Covid-19 Pill in Children", "date": "2022-03-09 06:45", "summary": "Drugmaker expects results from its study of Paxlovid in high-risk children by end of year. Pfizer Inc. has begun studying its Covid-19 pill in children under 18 years old who are at high risk of developing severe disease."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oligarchs-are-losing-a-favorite-haven-for-dirty-cash-11646826206", "title": "Oligarchs Are Losing a Favorite Haven for Dirty Cash", "date": "2022-03-09 06:43", "summary": "New laws will make it harder to launder funds through luxury property in London. With scrutiny of real estate also growing in the U.S., illicit money will have to find a new kind of home.. Britain is trying to purge the London property market of unsavory owners. Whether or not it succeeds, Russian oligarchs will need new places to launder dirty money."}, {"source": "wsj", "link": "https://www.wsj.com/articles/child-tax-credit-2021-2022-what-to-know-how-to-claim-11646419861", "title": "Child Tax Credit 2021-2022: What to Know", "date": "2022-03-09 06:00", "summary": "Two recent expansions of the child tax credit have helped millions of American parents. Congress has expanded the child tax credit twice since 2017, and these expansions have put needed dollars in the pockets of many parents. However, prepayments of the credits during 2021 will also create confusion during the 2022 tax-filing season and could leave some recipients owing unexpected tax bills for 2021. Here's what parents need to know."}, {"source": "wsj", "link": "https://www.wsj.com/articles/withholding-tax-estimated-taxes-how-they-work-11646428864", "title": "Withholdings and Estimated Tax Payments for 2021-2022: How They Work", "date": "2022-03-09 06:00", "summary": "Filers with uneven earnings or unemployment payments should check for tax underpayments to avoid penalties. The U.S. income tax is a pay-as-you-go system. The law requires most employees and self-employed business owners to pay at least 90% of their taxes long before the April due date."}, {"source": "wsj", "link": "https://www.wsj.com/articles/goodbye-londongrad-russian-oligarchs-put-pressure-on-u-k-property-market-11646823403", "title": "Goodbye Londongrad: Russian Oligarchs Put Pressure on U.K. Property Market", "date": "2022-03-09 05:56", "summary": "Russian oligarchs stormed London's high-end property market. Now they are under pressure and so is the city's real-estate sector.. Over the past two decades, London's high-end property market was overrun by the global superrich led by Russian oligarchs who did so many big, brash deals that locals called the city Londongrad."}, {"source": "wsj", "link": "https://www.wsj.com/articles/spring-is-here-but-sandals-and-shorts-arenttheyre-stuck-at-ports-or-sea-11646821802", "title": "Spring Is Here but Sandals and Shorts Aren't-They're Stuck at Ports or Sea", "date": "2022-03-09 05:30", "summary": "Supply-chain woes weighed on holiday sales for some retailers and now seasonal items may be slow to hit store shelves. It is almost spring, yet many retailers are still waiting for deliveries of shorts, sandals and other warm weather gear, a sign that the supply-chain problems of the past two years haven't abated."}, {"source": "wsj", "link": "https://www.wsj.com/articles/mainstream-hedge-funds-pour-billions-of-dollars-into-crypto-11646808223", "title": "Top Hedge Funds Pour Billions Into Crypto", "date": "2022-03-09 05:30", "summary": "Veteran traders including Alan Howard and Paul Tudor Jones are said to be increasing their trading in cryptocurrencies. Some of the biggest names in the hedge-fund world are betting on crypto."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-stinger-deliveries-to-ukraine-followed-long-search-for-technical-fix-11646773886", "title": "How Removing a Handful of Screws Allowed the Pentagon to Deliver Stingers to Ukraine", "date": "2022-03-09 23:24", "summary": "Taking out classified gear enabled the military to send the antiaircraft missiles after the Russian invasion. In the late fall of 2021, as Russian forces massed at the border of Ukraine, U.S. lawmakers pressed the Pentagon on why the Biden administration wasn't sending Stinger antiaircraft missiles to help Kyiv. The option wasn't available, they were told, because the weapons in the U.S. inventory contained classified equipment."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-probes-options-trade-that-gained-on-microsoft-activision-deal-11646787000", "title": "U.S. Probes Trade by Barry Diller, David Geffen Before Big Merger", "date": "2022-03-09 19:50", "summary": "Entertainment-industry titans made purchases days before Microsoft-Activision deal was announced. Federal prosecutors and securities regulators are investigating large bets that Barry Diller, Alexander von Furstenberg and David Geffen made on Activision Blizzard Inc. shares in January, days before the videogame maker agreed to be acquired by Microsoft Corp. , according to people familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/saudi-emirati-leaders-decline-calls-with-biden-during-ukraine-crisis-11646779430", "title": "Saudi, Emirati Leaders Decline Calls With Biden During Ukraine Crisis", "date": "2022-03-09 19:48", "summary": "Persian Gulf monarchies have signaled they won't help ease surging oil prices unless Washington supports them in Yemen, elsewhere. The White House unsuccessfully tried to arrange calls between President Biden and the de facto leaders of Saudi Arabia and the United Arab Emirates as the U.S. was working to build international support for Ukraine and contain a surge in oil prices, said Middle East and U.S. officials."}, {"source": "wsj", "link": "https://www.wsj.com/articles/usa-today-owner-gannett-co-gave-advertisers-inaccurate-information-for-nine-months-11646784745", "title": "USA Today Owner Gannett Co. Gave Advertisers Inaccurate Information for Nine Months", "date": "2022-03-09 19:12", "summary": "Publisher misrepresented where billions of ads were placed, researchers say, and Gannett corrected the issue in recent days. Publishing company Gannett Co. provided inaccurate information to advertisers for nine months, misrepresenting where billions of ads were placed, according to researchers who provided their findings exclusively to The Wall Street Journal."}]