[{"source": "wsj", "link": "https://www.wsj.com/articles/soaring-oil-prices-test-resiliency-of-u-s-stocks-11646217180", "title": "Soaring Oil Prices Test Resiliency of U.S. Stocks", "date": "2022-03-02 17:33", "summary": "While American companies face little exposure to the impact of Russian sanctions, global energy markets may be more at risk. Western firms appear well insulated against the impact of the sanctions imposed this week on Russia. Whether global markets will fare as well isn't yet clear."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-03-02-2022-11646210712", "title": "Dow, S&P Gain as Investors Eye Ukraine, Interest Rates", "date": "2022-03-02 17:25", "summary": "Crude prices surge as Russia struggles to maintain energy sales. U.S. stocks shot up, while oil prices also jumped, as investors parsed testimony on the Federal Reserve's plans to raise interest rates and watched for updates from Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/the-batman-will-cost-some-moviegoers-extra-in-u-s-cinemas-11646259249", "title": "'The Batman' Will Cost Some Moviegoers Extra in U.S. Cinemas", "date": "2022-03-02 17:14", "summary": "Movie theaters introduce variable pricing for expected blockbuster films. Holy higher prices, Batman."}, {"source": "wsj", "link": "https://www.wsj.com/articles/citigroups-jane-fraser-says-the-banks-overhaul-will-take-years-11646237007", "title": "Fraser Says Citi Overhaul Will Take Years", "date": "2022-03-02 17:13", "summary": "At her first investor day as CEO, Fraser laid out her vision and set a new profitability target. Citigroup Inc. has underperformed its big-bank peers and needs a comprehensive transformation that will take years, Chief Executive Jane Fraser told investors Wednesday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/dont-sleep-on-citigroup-11646255975", "title": "Don't Sleep on Citigroup", "date": "2022-03-02 16:19", "summary": "Its new goals for returns may not blow investors away, but it's disclosing more about the high-value businesses that could help it stay there. Citigroup may not yet have investors' faith in its latest effort at transformation. At least now it should have their attention."}, {"source": "wsj", "link": "https://www.wsj.com/articles/new-line-of-dr-seuss-inspired-books-coming-next-year-11646252801", "title": "New Series of Dr. Seuss-Inspired Books Coming Next Year", "date": "2022-03-02 15:26", "summary": "Stories will be based on original sketches by Theodor Seuss Geisel and written by group of up-and-coming writers. A new line of Dr. Seuss-inspired books are coming next year, based on sketches by the famous author that have never been published before."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sanction-carve-outs-for-energy-arent-enough-to-keep-money-flowing-to-russia-11646252514", "title": "Sanction Carve-Outs for Energy Aren't Enough to Keep Money Flowing to Russia", "date": "2022-03-02 15:21", "summary": "Businesses wary of violating rules are staying away from transactions with Russian companies. The aggressive sanctions against Russia left loopholes to allow payments for critical oil and gas supplies that fuel Europe-and the world's-economies. But businesses are instead going beyond, slapping a toxic label on anything to do with Russia, shunning its oil, refusing to issue insurance and cutting off financial transactions even with entities not on the sanctions list."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oil-tops-110-as-russia-struggles-to-maintain-energy-sales-11646195057", "title": "Oil Tops $110 as Ukraine Crisis Shakes Global Crude Trade", "date": "2022-03-02 15:07", "summary": "The invasion is triggering a reordering of global crude flows and upending relationships and assumptions that have guided the oil market for decades. Oil prices topped $110 a barrel for the first time in years on Wednesday as Russia's war in Ukraine started to scramble the world's oil flows and OPEC decided to stick with its plan to boost output only slightly."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ford-tries-to-create-an-inner-tesla-11646251451", "title": "Ford Tries to Create an Inner Tesla", "date": "2022-03-02 15:04", "summary": "Giving electric vehicles such as the Mustang Mach-E and F-150 Lightning a separate profit-and-loss account will make Ford's technological transition unusually transparent. Ford 's move to give its electric-vehicle business its own identity is about engineering of a cultural rather than financial kind, but that might change."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ford-creates-electric-vehicle-gas-engine-divisions-in-company-reshape-11646222458", "title": "Ford Creates Separate EV, Gas-Engine Divisions in Major Overhaul", "date": "2022-03-02 14:29", "summary": "Auto maker's reorganization keeps both operations in-house with separate names and leadership structures. Ford Motor Co. is reorganizing its operations to create two separate divisions-one for its conventional gas-engine business and another to focus on developing electric vehicles and software."}, {"source": "wsj", "link": "https://www.wsj.com/articles/wells-fargo-executive-tasked-with-rehabbing-banks-image-to-depart-11646248438", "title": "Wells Fargo Executive Overseeing Bank's Image to Depart", "date": "2022-03-02 14:13", "summary": "Barri Rafferty spent less than two years as head of the communications and brand management group. Wells Fargo & Co. is replacing its point person for remaking the bank's image after less than two years on the job."}, {"source": "wsj", "link": "https://www.wsj.com/articles/biden-expected-to-ban-russian-ships-from-entering-u-s-ports-11646247671", "title": "Biden Expected to Ban Russian Ships From Entering U.S. Ports", "date": "2022-03-02 14:01", "summary": "Russian commercial ships account for less than 1% of cargo volumes to the U.S.. The Biden administration is expected to ban Russian-flagged ships from entering U.S. ports, according to officials familiar with the matter, extending sanctions against the country following its invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/fanatics-raises-1-5-billion-at-27-billion-valuation-11646247220", "title": "Fanatics Raises $1.5 Billion at $27 Billion Valuation", "date": "2022-03-02 14:00", "summary": "Investors in latest round include Fidelity Management & Research, funds managed by BlackRock and Michael Dell's family office. Fanatics Inc. has raised $1.5 billion from a group of big investors, pushing the sports-merchandising giant's valuation to $27 billion as it works to expand beyond its core business, according to people familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oil-is-thicker-than-blood-for-opec-11646239856", "title": "Oil Is Thicker Than Blood for OPEC", "date": "2022-03-02 11:50", "summary": "It was easier for the Saudi Arabia-led oil cartel to reach an oil output decision this time around. Their choices will only get more difficult as long as the war in Ukraine continues.. When even Switzerland feels compelled to act then you know it is hard to remain neutral about Russia's invasion of Ukraine. But Saudi Arabia and the oil cartel it leads are willing to walk that diplomatic tightrope for now. Its oil-stained path will become slippery over time."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ralph-lauren-executive-howard-smith-resigns-over-personal-conduct-11646234443", "title": "Ralph Lauren Executive Howard Smith Resigns Over Personal Conduct", "date": "2022-03-02 11:39", "summary": "Luxury brand says board investigation found violations of company's policies. Ralph Lauren Corp. said Howard Smith, its chief commercial officer, has resigned after a board investigation found his behavior had violated the company's code of conduct."}, {"source": "wsj", "link": "https://www.wsj.com/articles/money-transfers-to-ukraine-surge-after-russian-invasion-11646236871", "title": "Money Transfers to Ukraine Surge", "date": "2022-03-02 11:01", "summary": "Payments to Ukranians more than doubled on the day of the Russian invasion. Money transfers to Ukraine have jumped since the Russian invasion."}, {"source": "wsj", "link": "https://www.wsj.com/articles/elvis-director-baz-luhrmann-to-list-manhattan-townhouse-for-19-995-million-11646234920", "title": "'Elvis' Director Baz Luhrmann to List Manhattan Townhouse for $19.995 Million", "date": "2022-03-02 10:28", "summary": "The 19th-century property is Anglo-Italianate in style and has wallpaper designed by his wife, Academy Award-winning costume designer Catherine Martin. Australian writer and director Baz Luhrmann and his wife and creative partner Catherine Martin are listing their New York home, a 19th-century townhouse with a bold, colorful interior, for $19.995 million."}, {"source": "wsj", "link": "https://www.wsj.com/articles/amid-ukraine-war-airlines-plot-detours-around-russia-as-flight-bans-intensify-11646232786", "title": "Airlines Scramble for Routes Around Russia as Flight Bans Intensify", "date": "2022-03-02 09:53", "summary": "Avoiding Russian airspace likely to increase costs for passengers and cargo, further snarling global supply chains. Airlines world-wide are altering routes and canceling flights to avoid Russian airspace, changes that will lengthen journey times and raise costs for carriers that were starting to bounce back from their pandemic slump."}, {"source": "wsj", "link": "https://www.wsj.com/articles/sofi-technologies-amc-salesforce-snowflake-what-to-watch-when-the-stock-market-opens-today-11646221713", "title": "SoFi Technologies, AMC, Salesforce, Snowflake: What to Watch in the Stock Market Today", "date": "2022-03-02 09:32", "summary": "SoFi Technologies lifted its earnings guidance; Snowflake results are due after the close. Wall Street stocks are up as the crisis in Ukraine continues to unfold (live coverage), with crude prices hovering near $110 a barrel. Here's what we're watching in Wednesday's trading:"}, {"source": "wsj", "link": "https://www.wsj.com/articles/western-oil-companies-leave-russia-to-their-state-run-rivals-11646229422", "title": "Western Oil Companies Leave Russia to Their State-Run Rivals", "date": "2022-03-02 08:57", "summary": "The exit has been less costly than the big write-downs imply, but it marks another step in the rise of national oil and gas companies. Selling out of Russia isn't as painful for Western oil and gas supermajors as the scale of their write-downs would suggest. But it will further diminish their global relevance relative to the real giants of the fossil-fuel industry today: state-controlled national oil companies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-casts-doubt-on-future-participation-in-international-space-station-11646226056", "title": "Russia Casts Doubt on Future Participation in International Space Station", "date": "2022-03-02 08:00", "summary": "NASA has been planning to extend the life of the station and wants private companies to develop space facilities. Russia's space agency raised doubts this week about its future involvement in the International Space Station, adding new uncertainty as the National Aeronautics and Space Administration makes plans to start winding down the research facility."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-crisis-puts-indian-economy-on-the-clock-11646224272", "title": "Ukraine Crisis Puts Indian Economy on the Clock", "date": "2022-03-02 07:31", "summary": "A sharp rise in rates-and a steeper selloff in Indian assets-isn't inevitable, but it could become so if the crisis drags on and oil prices keep moving higher. Once upon a time, Indian Prime Minister Narendra Modi promised to plumb the depths of the ocean and scale the heights of space with Vladimir Putin. Today, Russia's decision to invade Ukraine couldn't have come at a worse time for its old Cold War ally."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ben-melkmans-light-sky-macro-is-shutting-down-11646222401", "title": "Ben Melkman's Light Sky Macro is Shutting Down", "date": "2022-03-02 07:00", "summary": "Since launching with about $900 million, he has made about 1% a year over the last five years. A macro investor told clients this week that he plans to shut down his hedge-fund firm, Light Sky Macro LP, according to people familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/booking-holdings-shareholders-need-a-staycation-11646220600", "title": "Booking Holdings Shareholders Need a Staycation", "date": "2022-03-02 06:30", "summary": "Platform might soar once it reaches its final destination, but it has more hills to climb first. After paring down his platform during the Covid-19 pandemic to focus on core homestay and with his business coming off its strongest year ever, Airbnb Chief Executive Officer Brian Chesky is using a relatively inexpensive gimmick to sell long-term stays-becoming a nomad who lives on the site's properties."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hot-pot-billionaire-steps-down-as-ceo-as-investors-stew-about-overexpansion-11646217745", "title": "Hot-Pot Billionaire Steps Down as CEO", "date": "2022-03-02 05:42", "summary": "It comes as Haidilao warned it expected to record an annual loss. The billionaire entrepreneur who co-founded Haidilao International Holding Ltd. has stepped down as chief executive, as the Chinese chain of hot-pot restaurants tries to move past an ill-timed expansion during the pandemic."}, {"source": "wsj", "link": "https://www.wsj.com/articles/divesting-from-russia-proves-complicated-for-pension-funds-11646193559", "title": "Pension Funds Struggle to Divest From Russia", "date": "2022-03-02 05:33", "summary": "Retirement systems plan to dump Russian holdings but face a lack of buyers and financial-services providers. Pension funds around the world are reviewing their investments in Russia's energy, banking and mining sectors in the wake of the country's invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/furnace-repair-businesses-endure-long-winter-of-parts-shortages-11646217001", "title": "Furnace Repair Businesses Endure Long Winter of Parts Shortages", "date": "2022-03-02 05:30", "summary": "High demand, climbing prices and backlogged inventories lead climate-control servicers to find expensive workarounds and rethink supplier relationships. In a winter beset by supply-chain snarls, furnace maintenance companies said it can be a struggle to keep the heat on."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-war-leads-to-more-global-business-disruption-11646173915", "title": "Major Western Companies Retreat From Russia", "date": "2022-03-02 03:55", "summary": "iPhone maker halts Russia sales, Volkswagen says flagship plant could close because of lack of parts from Ukraine. Apple Inc., Ford Motor Co. and Dell Technologies Inc. joined the roster of companies retreating from Russia, while other global businesses, including Volkswagen AG , warned of further supply disruptions following the country's invasion of Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-iea-agree-to-release-60-million-barrels-from-oil-stockpiles-amid-ukraine-turmoil-11646151424", "title": "U.S., IEA Agree to Release 60 Million Barrels From Oil Stockpiles", "date": "2022-03-02 22:39", "summary": "Decision comes as oil prices surge above $100 a barrel over worries about Russian crude production. The U.S. and other major oil-consuming nations said Tuesday they would release 60 million barrels of oil from their emergency stockpiles, sending a jolt of new crude supplies into the market amid a price surge caused by the Ukraine crisis."}, {"source": "wsj", "link": "https://www.wsj.com/articles/bitcoin-demand-booms-in-ukraine-and-russia-11646165756", "title": "Bitcoin Price Jumps as Demand in Ukraine and Russia Booms", "date": "2022-03-02 21:53", "summary": "The cryptocurrency has been trading at a premium against the Ukrainian hryvnia. The Russian invasion of Ukraine has driven demand for cryptocurrencies in both countries, helping boost the price of bitcoin."}, {"source": "wsj", "link": "https://www.wsj.com/articles/directv-drops-russia-backed-rt-from-its-pay-television-packages-11646164416", "title": "Kremlin-Backed Media Face Growing Global Crackdown", "date": "2022-03-02 21:15", "summary": "DirecTV said Tuesday it will drop RT, as rival Dish weighs options; Europe unveiled wide-ranging sanctions on Russian outlets. RT and other Russia-backed media outlets are facing an unprecedented squeeze in response to Russia's invasion of Ukraine, as pay TV operators and tech platforms across the globe take steps to curtail their reach."}, {"source": "wsj", "link": "https://www.wsj.com/articles/exxon-to-shut-down-oil-production-in-russia-after-ukraine-attack-11646180028", "title": "Exxon to Shut Down Oil Production in Russia After Ukraine Attack", "date": "2022-03-02 19:38", "summary": "Texas energy giant will exit its Sakhalin project in Russia's Far East, following similar moves by BP and Shell. Exxon Mobil Corp. said it is halting operations at a multibillion-dollar oil and gas project in Russia and will make no further investments in the country following its attack on Ukraine."}]