[{"source": "wsj", "link": "https://www.wsj.com/articles/lordstown-motors-reports-deepening-losses-11646062807", "title": "Lucid Slashes Vehicle-Production Target", "date": "2022-02-28 18:29", "summary": "Electric-vehicle maker's cutback shows challenges of supply-chain constraints, shift from startup to mass producer. Electric car maker Lucid Group Inc. cut its 2022 vehicle-production target, underscoring the twin challenges of global supply-chain snags and the transition from startup to mass production."}, {"source": "wsj", "link": "https://www.wsj.com/articles/cnns-future-owner-taps-tv-news-veteran-chris-licht-to-lead-network-11646065747", "title": "CNN's New Boss Overcame Brush With Death, Helped Create 'Morning Joe' and Revived Stephen Colbert", "date": "2022-02-28 17:58", "summary": "Chris Licht plans to adjust CNN's programming mix to include more hard news and less opinion. On an April morning in 2010, the future leader of CNN heard a pop in his skull and was suddenly stricken by a vicious headache."}, {"source": "wsj", "link": "https://www.wsj.com/articles/albertsons-launches-strategic-review-11646083966", "title": "Albertsons Launches Strategic Review", "date": "2022-02-28 17:58", "summary": "The parent company of grocery chains Safeway and Jewel-Osco went public in 2020. Albertsons Cos. Inc. said Monday its board has started a strategic review to consider potential transactions and other moves, less than two years after the supermarket chain's initial public offering."}, {"source": "wsj", "link": "https://www.wsj.com/articles/target-is-raising-its-minimum-wage-to-24-an-hour-in-some-markets-11646061589", "title": "Retailers' Wage Increases to Attract Workers Aren't Yet Denting Profits", "date": "2022-02-28 17:55", "summary": "Target said its plans to bolster its pay and benefits would cost up to $300 million. Large retailers and other employers that hire hourly workers are continuing to lift wages, and so far have kept profits growing as well."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hp-raises-annual-profit-outlook-despite-impact-of-russian-sanctions-11646087241", "title": "HP Raises Profit Outlook for the Year", "date": "2022-02-28 17:27", "summary": "The PC and printer maker sees small earnings hit in current quarter from Ukraine crisis. HP Inc. raised its annual profit outlook, boosted by strong sales of computers to businesses, but warned that Russia's invasion of Ukraine would dent its bottom line this quarter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/-global-stocks-markets-dow-update-02-27-22-11646005878", "title": "Stocks Fall, Oil Leaps as Ukraine Crisis Deepens", "date": "2022-02-28 17:05", "summary": "Russian ruble plunges to record low before recovering moderately. The crisis in Ukraine continued to stoke turbulence across global markets, helping send the S&P 500 lower for a second straight month and Russian markets plunging."}, {"source": "wsj", "link": "https://www.wsj.com/articles/bond-market-shakes-off-hefty-swings-in-sentiment-11646003578", "title": "Bond Market Shakes Off Hefty Swings in Sentiment", "date": "2022-02-28 16:56", "summary": "Investors continue to expect a steady rise in rates over the course of 2022. A volatile market week spurred in part by the Russian attack on Ukraine has done little to change investor expectations that U.S. interest rates will rise steadily throughout 2022."}, {"source": "wsj", "link": "https://www.wsj.com/articles/oil-natural-gas-prices-vault-as-sanctions-threaten-russias-commodity-exports-11646049246", "title": "Oil Producers Including U.S. Weigh Reserve Releases as War Prompts Rise in Prices", "date": "2022-02-28 16:46", "summary": "European energy ministers are due to discuss steps to maintain energy supplies while war wages on eastern flank. The U.S. and other major oil-consuming nations are considering releasing 70 million barrels of oil from their emergency stockpiles as crude prices surge, European and Persian Gulf officials briefed on the plan say, amid growing concerns over supply after Russia invaded Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-ukraine-business-what-to-know-11645812614", "title": "What the Russia-Ukraine Crisis Means for Businesses", "date": "2022-02-28 16:33", "summary": "Big brewers, major oil companies, auto makers and airlines are grappling with the fallout from the attack. Russia's assault on Ukraine has left Western companies scrambling to ensure the safety of their workers, while girding for disruption stemming from Western sanctions."}, {"source": "wsj", "link": "https://www.wsj.com/articles/western-companies-pull-back-from-russia-in-response-to-ukraine-invasion-sanctions-11646067812", "title": "Western Companies Pull Back From Russia in Response to Ukraine Invasion, Sanctions", "date": "2022-02-28 16:07", "summary": "Country once seen as promising new market now poses challenges spanning logistics to reputation. British energy giant Shell PLC became the latest big Western company to sever ties with Russia over its invasion of Ukraine, saying it would pull back from joint projects in the country and quit its role financing the now-halted Nord Stream 2 gas pipeline."}, {"source": "wsj", "link": "https://www.wsj.com/articles/estee-lauder-fires-executive-john-demsey-11646057171", "title": "Estée Lauder Fires Executive John Demsey Over Instagram Post", "date": "2022-02-28 16:01", "summary": "Senior executive had posted a meme on his Instagram account that contained a racial slur and joke about Covid-19. Estée Lauder Cos. has fired John Demsey, a senior executive who last week posted a meme on his personal Instagram account that contained a racial slur and a joke about Covid-19."}, {"source": "wsj", "link": "https://www.wsj.com/articles/top-companies-for-customer-satisfaction-11646078657", "title": "Top Companies for Customer Satisfaction", "date": "2022-02-28 15:04", "summary": "Cisco Systems, Agilent and IBM score highest in this category in the Management Top 250 ranking. Cisco Systems Inc. is No. 1 for customer satisfaction in the latest Management Top 250 ranking, followed by Agilent Technologies Inc. and International Business Machines Corp."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-energy-giants-gazprom-rosneft-fuel-moscows-state-coffers-11646043993", "title": "Shares of Russian Energy Giants, Putin's Safety Net, Tumble", "date": "2022-02-28 13:36", "summary": "London-listed companies not only finance the Russian government, they have also assisted Putin's foreign policy, Western officials say. Russia's financial system was under siege Monday, but the country is still pumping and exporting vast amounts of oil and natural gas to the rest of the world, delivering cash in the face of Western sanctions and a financial cushion for President Vladimir Putin. At the heart of it lie two London-listed energy giants."}, {"source": "wsj", "link": "https://www.wsj.com/articles/bps-sudden-russia-exit-exposes-risks-for-western-companies-in-ukraine-crisis-11646070000", "title": "BP's Sudden Russia Exit Exposes Risks for Western Companies", "date": "2022-02-28 13:17", "summary": "The British oil firm will face challenges to getting full value for the Rosneft stake that it plans to divest. BP PLC's abrupt unwinding of Russia ties that were 30 years in the making shows the mounting risks Western companies face doing business there-and the mess they can face getting out."}, {"source": "wsj", "link": "https://www.wsj.com/articles/shell-to-exit-joint-ventures-with-gazprom-citing-russia-invasion-of-ukraine-11646071440", "title": "Shell to Exit Joint Ventures With Gazprom, Citing Russia Invasion of Ukraine", "date": "2022-02-28 13:04", "summary": "Energy giant's move follows BP decision to divest its stake in Russia's state-controlled oil producer Rosneft. LONDON- Shell PLC said it would exit its joint ventures with Russian energy giant Gazprom PJSC, a day after BP PLC said it would divest its nearly 20% stake in Russia's state-controlled oil producer Rosneft ."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chevron-buys-biofuel-company-for-3-15-billion-11646068044", "title": "Chevron to Buy Biofuel Company for $3.15 Billion", "date": "2022-02-28 12:45", "summary": "Deal to acquire Renewable Energy Group comes as the oil-and-gas giant seeks to invest more in lower-carbon energy sources. Chevron Corp. is making one of its largest investments in renewable fuels, paying $3.15 billion to buy a company that makes diesel and other fuels from sources such as corn or cooking oil as the fossil-fuel giant faces investor pressure to invest in green energy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/citigroup-has-nearly-10-billion-in-total-russian-exposure-11646066390", "title": "Citigroup Has Nearly $10 Billion in Russian Exposure", "date": "2022-02-28 11:39", "summary": "Sanctions complicate Citigroup's attempt to sell its Russian consumer bank. Citigroup Inc. disclosed Monday it had nearly $10 billion in total exposures to Russia at the end of 2021, some of which sit in a consumer bank it has been trying to sell and may now be stuck with."}, {"source": "wsj", "link": "https://www.wsj.com/articles/neil-diamond-sells-music-catalog-to-universal-music-group-11646056565", "title": "Neil Diamond Sells Music Catalog, Recording Rights to Universal Music", "date": "2022-02-28 10:53", "summary": "Singer's deal is latest in a string of artists selling their work, as value of royalty revenue from music rights climbs. Neil Diamond sold his song catalog and recording rights to Universal Music Group , the latest deal of musicians selling their portfolios."}, {"source": "wsj", "link": "https://www.wsj.com/articles/central-bank-squeeze-lacks-energy-to-cripple-russias-economy-11646062881", "title": "Central Bank Squeeze Lacks Energy to Cripple Russia's Economy", "date": "2022-02-28 10:41", "summary": "While blocking official currency reserves puts ruble and economy under heavy pressure, they are underpinned by commodity exports. It is hard to conceive a complete collapse of Russia's economy as long as it can keep selling its oil at almost $100 a barrel."}, {"source": "wsj", "link": "https://www.wsj.com/articles/energy-sanctions-are-a-weapon-putin-would-understand-11646062745", "title": "Energy Sanctions Are a Weapon Putin Would Understand", "date": "2022-02-28 10:39", "summary": "Oil and gas have proven potent in changing Moscow's behavior before, whereas selective measures only tend to strengthen autocrats. Sanctions against Vladimir Putin's war machine won't really bite until they include energy. However dramatic, this is a step investors would be unwise to rule out."}, {"source": "wsj", "link": "https://www.wsj.com/articles/td-expands-u-s-footprint-with-13-4-billion-acquisition-of-first-horizon-11646050132", "title": "TD Expands in U.S. With $13.4 Billion Acquisition of First Horizon", "date": "2022-02-28 10:20", "summary": "Toronto-Dominion says it is accelerating its long-term growth strategy. TORONTO- Toronto-Dominion Bank 's chief executive, Bharat Masrani, has finally made a big deal in the Southeastern U.S., announcing a $13.4 billion all-cash purchase of Tennessee-based First Horizon Monday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/nio-novavax-lockheed-yandex-first-horizon-what-to-watch-when-the-stock-market-opens-today-11646049445", "title": "NIO, Novavax, Lockheed, Yandex, First Horizon: What to Watch in the Stock Market Today", "date": "2022-02-28 09:35", "summary": "China's NIO is planning a secondary listing in Hong Kong; Results are due from Novavax. Wall Street stocks fell and oil prices jumped as investors rushed to adjust to geopolitical developments including new sanctions against Russia. Here's what we're watching in Monday's trading:"}, {"source": "wsj", "link": "https://www.wsj.com/articles/jane-fraser-makes-her-big-pitch-to-citi-investors-11646049601", "title": "Jane Fraser Makes Her Pitch to Citi Investors", "date": "2022-02-28 09:24", "summary": "This week the bank will host its first investor day in nearly five years. One year into her job, Citigroup Inc. Chief Executive Jane Fraser takes the stage this week to pitch investors her strategy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chinese-tesla-rival-nio-plans-secondary-listing-in-hong-kong-11646028608", "title": "Chinese Tesla Rival NIO Plans Secondary Listing in Hong Kong", "date": "2022-02-28 08:29", "summary": "EV manufacturer also seeks to join Singapore's stock market. Electric-vehicle maker NIO Inc. plans to list shares in Hong Kong, joining other Chinese businesses pursuing an additional listing outside New York as companies from China face the threat of being forced off American exchanges."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-shale-producers-sing-the-same-tune-11646051580", "title": "U.S. Shale Producers Sing the Same Tune", "date": "2022-02-28 07:33", "summary": "Large U.S. shale producers-from the most indebted to the least-are all sticking to the same script. Sorry, cash-strapped consumers: If you thought OPEC was stingy about oil output, large U.S. shale producers aren't here to help, either."}, {"source": "wsj", "link": "https://www.wsj.com/articles/music-needs-to-get-the-show-back-on-the-road-11646049780", "title": "Music Needs to Get the Show Back on the Road", "date": "2022-02-28 07:03", "summary": "Live Nation's shares have surged as investors bank on pent-up concert demand in 2022. The music business has done quite well in the pandemic despite having one arm tied behind its back. Investors are betting big that this is a breakout year for live performances."}, {"source": "wsj", "link": "https://www.wsj.com/articles/buy-now-pay-later-credit-score-equifax-how-to-prepare-11645985862", "title": "Buy-Now-Pay-Later Purchases Will Start to Show Up on Credit Reports: How to Prepare", "date": "2022-02-28 05:30", "summary": "Starting today, Equifax will record 'pay-in-four' installment loans in credit reporting. If you use these services, here's how to keep your credit score intact.. People using buy-now-pay-later services such as Klarna and Afterpay take note: Those purchases-and payment records-will soon show up on credit reports."}, {"source": "wsj", "link": "https://www.wsj.com/articles/inflation-raises-expenses-for-pension-funds-11646000689", "title": "Inflation Raises Expenses for Pension Funds", "date": "2022-02-28 05:30", "summary": "Cost-of-living increases are rising significantly for the first time in years, adding to retirement system liabilities. Rising inflation is driving up expenses for many large U.S. pension funds that have promised retirees cost-of-living raises."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russian-planes-barred-from-airspace-over-europe-canada-11645995117", "title": "Russian Planes Barred From Airspace Over Europe, Canada", "date": "2022-02-28 23:57", "summary": "Russian aircraft face limited corridors where they can operate and will be forced to seek other routes. The European Union and Canada on Sunday said they would bar Russian planes from entering their airspace, joining other countries in choking off Russia's access to global aviation routes in response to its invasion of Ukraine."}]