[{"source": "wsj", "link": "https://www.wsj.com/articles/sweetgreens-sales-climb-on-higher-prices-return-of-office-workers-11646350604", "title": "Sweetgreen's Sales Climb on Higher Prices, Return of Office Workers", "date": "2022-03-03 18:36", "summary": "Salad chain's shares jump after company reports better-than-expected revenue for holiday quarter and current year. Shares of Sweetgreen Inc. rose 19% in extended-hours trading after the salad chain reported better-than-expected results and outlook, boosted by higher prices and workers increasingly returning to the office."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-03-03-2022-11646296452", "title": "Stocks Finish Lower; Oil Prices Decline", "date": "2022-03-03 17:13", "summary": "The Dow industrials and S&P 500 have dropped in three of the past four sessions. U.S. stocks edged lower Thursday as investors assessed how a recent jump in commodities prices is likely to affect inflation and the Federal Reserve's monetary policy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/best-buy-posts-lower-sales-on-supply-chain-hit-omicron-impact-11646312780", "title": "Best Buy Posts Lower Sales", "date": "2022-03-03 17:06", "summary": "The company said U.S. sales fell in gaming, mobile phones, tablets and services, but comparable sales grew 10.4%; shares rose 9%. Best Buy Co. 's sales for the holiday quarter fell from a year earlier, as reduced store hours due to labor shortages caused by the Omicron variant and supply-chain challenges disrupted operations."}, {"source": "wsj", "link": "https://www.wsj.com/articles/electric-vehicle-startup-rivian-walks-back-price-increase-apologizes-to-customers-11646321716", "title": "Electric-Vehicle Startup Rivian Walks Back Price Increase, Apologizes", "date": "2022-03-03 17:02", "summary": "Price rise on already-ordered electric trucks and SUVs sent Rivian's stock sliding this week. Rivian Automotive Inc. is walking back a hefty price increase for its electric trucks and SUVs that was put into effect earlier this week, saying it will now honor prices for customers who previously ordered a vehicle."}, {"source": "wsj", "link": "https://www.wsj.com/articles/kroger-sales-earnings-grow-as-higher-costs-persist-11646315138", "title": "Kroger Sales, Earnings Grow as Higher Costs Persist", "date": "2022-03-03 16:50", "summary": "Supermarket company said costs have continued to climb for some food categories; shares settled at all-time high. Kroger Co. said its streak of strong sales and profits continued in the latest quarter, as U.S. consumers have been eating more at home."}, {"source": "wsj", "link": "https://www.wsj.com/articles/amazon-moves-to-force-ftc-antitrust-decision-on-mgm-deal-11646341124", "title": "Amazon Moves to Force FTC Antitrust Decision on MGM Deal", "date": "2022-03-03 16:19", "summary": "Deadline could make it difficult for the commission to take action before the tech giant completes the transaction. Amazon.com Inc. has given the Federal Trade Commission a fast-approaching deadline to deliver a verdict on its proposed $6.5 billion acquisition of the MGM movie and television studio, a move that could make it difficult for the agency to challenge the deal before the tech giant completes it."}, {"source": "wsj", "link": "https://www.wsj.com/articles/snowflake-melts-on-contact-with-cloud-washout-11646330284", "title": "Snowflake Melts on Contact With Cloud Washout", "date": "2022-03-03 16:16", "summary": "Richest-valued cloud stock is the latest tripped up by a harsh sector selloff. Not even Snowflake can compete with itself sometimes."}, {"source": "wsj", "link": "https://www.wsj.com/articles/some-russian-bond-trading-defrosts-as-investors-hunt-for-deals-11646339049", "title": "Some Russian Bond Trading Defrosts as Investors Hunt for Deals", "date": "2022-03-03 15:26", "summary": "Secondary-market trading of Russian debt could help pensions and asset managers shed investments from the country. The freeze that Western sanctions put on Russian bond markets is starting to thaw despite the looming risk of the country's first potential default in over two decades."}, {"source": "wsj", "link": "https://www.wsj.com/articles/best-buy-bets-best-days-are-ahead-11646336324", "title": "Best Buy Bets Best Days Are Ahead", "date": "2022-03-03 14:38", "summary": "The retailer's growth will come from less tangible areas and requires a leap of faith. After a rough holiday season, Best Buy would like to focus on the future."}, {"source": "wsj", "link": "https://www.wsj.com/articles/microsoft-spacex-airbnb-and-others-offer-ukraine-assistance-11646332536", "title": "How Western Companies Are Offering Ukraine Support", "date": "2022-03-03 13:35", "summary": "Some Western businesses are providing tech, internet and housing support during Russia's assault. Western companies including Microsoft Corp. , GlaxoSmithKline PLC and SpaceX are offering assistance to Ukraine, helping guard against cyberattacks, providing painkillers and setting up internet services amid Russia's continuing assault."}, {"source": "wsj", "link": "https://www.wsj.com/articles/melinda-french-gates-says-she-was-upset-with-bill-gatess-meetings-with-jeffrey-epstein-11646319537", "title": "Melinda French Gates Says She Was Upset Over Bill Gates's Epstein Meetings", "date": "2022-03-03 12:23", "summary": "Billionaire says she voiced her dislike to her then-husband and regretted meeting convicted sex offender herself; 'I had nightmares about it afterwards'. Melinda French Gates said she was upset with Bill Gates's past meetings with convicted sex offender Jeffrey Epstein, addressed the Microsoft Corp. co-founder's earlier affair and said she and her former husband have a working relationship focused on philanthropy."}, {"source": "wsj", "link": "https://www.wsj.com/articles/arcelormittal-closes-giant-ukrainian-steel-plant-as-war-worsens-11646326879", "title": "ArcelorMittal Closes Giant Ukrainian Steel Plant", "date": "2022-03-03 12:01", "summary": "Steel mill joins other foreign-owned operations suspended amid Russian invasion, likely putting further pressure on metal prices. A giant Ukrainian steel mill owned by ArcelorMittal SA closed on Thursday, shutting one the country's largest pieces of industry after days of holding out as other foreign companies retreated in the face of Russia's onslaught."}, {"source": "wsj", "link": "https://www.wsj.com/articles/biggest-mistakes-families-make-when-appealing-college-financial-aid-decisions-11646325797", "title": "Biggest Mistakes That Families Make When Appealing College Financial-Aid Decisions", "date": "2022-03-03 12:00", "summary": "No. 1 financial-appeal mistake: Not asking for a review in the first place. As college financial-aid award letters trickle in, many families will find the offers coming up unexpectedly short because of how the pandemic has affected their lives."}, {"source": "wsj", "link": "https://www.wsj.com/articles/airlines-reroute-flight-paths-to-avoid-russia-ukraine-11646323926", "title": "Airlines Reroute Flight Paths to Avoid Russia, Ukraine", "date": "2022-03-03 11:12", "summary": "Flight-traffic maps show commercial airlines skirt Russian airspace. Airlines around the world are rerouting flight paths after the recent surge of airspace-travel restrictions following Russia's invasion of Ukraine. The European Union barred Russian aircraft from traversing its airspace, consequently triggering Moscow's reciprocal ban on European aircraft."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ben-jerrys-israeli-manufacturer-files-lawsuit-over-license-termination-11646322615", "title": "Ben & Jerry's Israeli Manufacturer Files Lawsuit Over License Termination", "date": "2022-03-03 10:50", "summary": "Company declined to renew contract because of sales in Israeli-occupied West Bank and parts of contested East Jerusalem, lawsuit says. An Israeli ice cream manufacturer has filed a breach of contract lawsuit against Ben & Jerry's, claiming his license wasn't renewed because of where he sells his products."}, {"source": "wsj", "link": "https://www.wsj.com/articles/irs-is-audited-over-its-safeguards-against-favored-treatment-of-big-business-11646321334", "title": "IRS Is Audited Over Its Safeguards Against Favored Treatment of Big Business", "date": "2022-03-03 10:28", "summary": "Agency watchdog examines how IRS handles whistleblower claims. The Internal Revenue Service's watchdog is examining how the agency guards against favoring large businesses and global companies in compliance matters as part of a broad audit."}, {"source": "wsj", "link": "https://www.wsj.com/articles/mortgage-rates-are-still-low-heres-how-home-buyers-can-lock-in-rates-11646303402", "title": "How Home Buyers Can Lock In Low Mortgage Rates", "date": "2022-03-03 10:24", "summary": "Improving a credit score and using discount points can help buyers obtain a better deal, even as interest rates are expected to rise. Interest rates on mortgages are expected to rise as the Federal Reserve is on track to tighten monetary policy this year. Yet for now, rates are staying low."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-bitcoin-and-a-crypto-exchange-became-part-of-ukraines-war-effort-11646320697", "title": "How a Crypto Exchange Became Part of Ukraine's War Effort", "date": "2022-03-03 10:18", "summary": "Kuna, Ukraine's largest crypto exchange, has emerged as central hub for the country's efforts to raise funds via cryptocurrencies. The founder of Ukraine's largest cryptocurrency exchange, Kuna, has been sleeping only a few hours a day since Russia invaded his country."}, {"source": "wsj", "link": "https://www.wsj.com/articles/elon-musk-invites-uaw-to-hold-union-vote-at-tesla-11646292963", "title": "Elon Musk Invites UAW to Hold Union Vote at Tesla", "date": "2022-03-03 10:15", "summary": "'Tesla will do nothing to stop them,' the chief executive says. Tesla Inc. Chief Executive Elon Musk said he was open to the United Auto Workers union holding a vote about organizing labor at the company after long resisting such a move."}, {"source": "wsj", "link": "https://www.wsj.com/articles/do-bucket-investment-strategies-make-sense-in-retirement-11646319962", "title": "Do 'Bucket' Investment Strategies Make Sense in Retirement?", "date": "2022-03-03 10:06", "summary": "Also in this month's Ask Encore: We answer a reader's question about Social Security survivor benefits. What do you think about \"bucket\" strategies when it comes to managing investments in retirement? Do buckets, in the long run, produce better results than other withdrawal strategies?"}, {"source": "wsj", "link": "https://www.wsj.com/articles/snowflake-tesla-big-lots-splunk-what-to-watch-when-the-stock-market-opens-today-11646306956", "title": "Best Buy, Kroger, Snowflake, Tesla, Big Lots: What to Watch in the Stock Market Today", "date": "2022-03-03 09:37", "summary": "Snowflake's sales outlook came in below expectations; Elon Musk said he was open to a UAW vote on organizing Tesla workers. Wall Street stocks advanced and crude prices hovered around $110 a barrel as the war in Ukraine raged on. Here's what we're watching in Thursday's trading."}, {"source": "wsj", "link": "https://www.wsj.com/articles/a-closed-russia-market-after-invasion-challenges-u-s-fund-managers-11646303401", "title": "Closed Russia Market Challenges U.S. Fund Managers", "date": "2022-03-03 09:35", "summary": "BlackRock is among firms that have had informal discussions with SEC officials on difficulty of exiting positions in Russian securities. Russia's invasion of Ukraine has created a conundrum for U.S. investment firms, pressuring them to unload Russian securities when the country's stock market is closed and foreigners are blocked from selling shares there."}, {"source": "wsj", "link": "https://www.wsj.com/articles/is-the-china-reopening-trade-for-real-11646313328", "title": "Is the China Reopening Trade for Real?", "date": "2022-03-03 08:15", "summary": "Hints are emerging that China may begin moving away from 'zero-Covid' approach. That would mark a sea change for consumer shares.. Is China finally opening up? The mere whisper of a plan to do so could be good news for companies relying on Chinese consumers and travelers. Such whispers are now beginning to percolate out of the Middle Kingdom, which has remained essentially closed to the outside world for the past two years."}, {"source": "wsj", "link": "https://www.wsj.com/articles/if-currency-reserves-arent-really-money-the-world-is-in-for-a-shock-11646311306", "title": "If Russian Currency Reserves Aren't Really Money, the World Is in for a Shock", "date": "2022-03-03 07:44", "summary": "Sanctions have shown that currency reserves accumulated by central banks can be taken away. With China taking note, this may reshape geopolitics, economic management and even the international role of the U.S. dollar.. \"What is money?\" is a question that economists have pondered for centuries, but the blocking of Russia's central-bank reserves has revived its relevance for the world's biggest nations-particularly China. In a world in which accumulating foreign assets is seen as risky, military and economic blocs are set to drift farther apart."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ukraine-war-plunges-auto-makers-into-new-supply-chain-crisis-11646309152", "title": "Ukraine War Plunges Auto Makers Into New Supply-Chain Crisis", "date": "2022-03-03 07:05", "summary": "Car manufacturers halt Russian factories, sales as sanctions bite. BERLIN-After a pandemic and a global chip crunch, Russia's war in Ukraine has unleashed auto makers' third supply-chain crisis in as many years."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chinese-property-developers-broken-promises-erode-investor-confidence-11646305569", "title": "Chinese Property Developers' Broken Promises Erode Investor Confidence", "date": "2022-03-03 06:06", "summary": "China's property-bond market remains deeply distressed as real-estate sales fall and investors retreat on a lack of trust. After more than 10 dollar-debt defaults by property developers over the past year, many investors have come to the conclusion that trust is broken in the $200 billion market for high-yield bonds of Chinese companies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/rnc-seeks-to-choke-debate-commission-fundraising-in-escalation-of-dispute-11646305200", "title": "RNC Seeks to Choke Debate Commission Fundraising in Escalation of Dispute", "date": "2022-03-03 06:00", "summary": "Past sponsors have included large corporations, foundations and associations. The Republican National Committee is trying to choke off fundraising for the commission that's been the organizer of general election presidential debates for more than three decades, escalating a dispute that's been brewing for years."}, {"source": "wsj", "link": "https://www.wsj.com/articles/greg-kelly-former-ghosn-aide-at-nissan-gets-six-month-suspended-sentence-11646270567", "title": "Greg Kelly, Former Ghosn Aide at Nissan, Gets Six-Month Suspended Sentence", "date": "2022-03-03 03:04", "summary": "He probably won't have to serve prison time. TOKYO-Former Nissan Motor Co. executive Greg Kelly was found guilty of helping former Chief Executive Carlos Ghosn evade Japan's pay-disclosure laws during one fiscal year, but the Tokyo District Court cleared him of other charges and gave him a suspended sentence, meaning he probably won't have to serve prison time."}, {"source": "wsj", "link": "https://www.wsj.com/articles/china-weighs-methods-for-relaxing-zero-covid-19-grip-bubbles-drugs-and-new-messaging-11646230580", "title": "China's Pandemic Plight: Learning How to Live With Covid-19", "date": "2022-03-03 23:45", "summary": "The world's strictest pandemic-control regime likely won't be relaxed until next year, but experimental opening measures could come as soon as summer. China, the last major country to stick with a zero-tolerance approach to Covid-19, is now actively exploring ways to loosen controls."}, {"source": "wsj", "link": "https://www.wsj.com/articles/amazon-workers-at-second-new-york-warehouse-to-hold-union-vote-11646280703", "title": "Amazon Workers at Second New York Warehouse to Hold Union Vote", "date": "2022-03-03 23:37", "summary": "Employees at a second facility in Staten Island have shown enough support to proceed with election, union organizers and the company said. Amazon.com Inc. workers at a second company facility in New York will vote on a union, escalating one of a growing list of labor battles for the e-commerce giant."}, {"source": "wsj", "link": "https://www.wsj.com/articles/peloton-founder-sells-50-million-of-shares-to-michael-dells-investment-firm-11646268211", "title": "Peloton Founder Sells $50 Million of Shares to Firm Backed by Michael Dell", "date": "2022-03-03 21:32", "summary": "Ex-CEO John Foley still maintains effective control of Peloton after sale to MSD Partners. Peloton Interactive Inc.'s founder and former chief executive, John Foley, has sold about $50 million worth of shares in the company to an investment firm backed by computer entrepreneur Michael Dell, according to a securities filing Wednesday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/ex-goldman-banker-a-key-1mdb-trial-witness-is-challenged-by-defense-11646267122", "title": "Ex-Goldman Banker Challenged by Defense in 1MDB Trial", "date": "2022-03-03 20:35", "summary": "Lawyers for the defendant, Roger Ng, seek to undermine the account of a one-time colleague, Timothy Leissner. The defense team for a former Goldman Sachs Group Inc. banker facing charges in the looting of a Malaysian sovereign-wealth fund sought to undermine the testimony of the prosecution's star witness during trial proceedings Wednesday, arguing that the witness made inconsistent statements to federal investigators."}]