[{"source": "wsj", "link": "https://www.wsj.com/articles/apple-exxon-mobil-rivian-stocks-that-defined-the-week-11646436656", "title": "Apple, Exxon Mobil, Rivian: Stocks That Defined the Week", "date": "2022-03-04 18:30", "summary": "Here are seven major companies whose stocks moved on the week's news. Apple Inc."}, {"source": "wsj", "link": "https://www.wsj.com/articles/global-stocks-markets-dow-update-03-04-2022-11646371339", "title": "Dow Declines to End Week as Russia, Ukraine Concerns Mount", "date": "2022-03-04 18:13", "summary": "Strong U.S. jobs number wasn't enough to lift stocks. The Dow Jones Industrial Average ended its fourth week of losses and bond yields recorded their biggest one-week decline since March 2020 as Russia's military campaign in Ukraine intensified."}, {"source": "wsj", "link": "https://www.wsj.com/articles/activision-ceo-bobby-kotick-steps-down-from-coca-cola-board-11646428990", "title": "Activision CEO Bobby Kotick to Step Down From Coca-Cola Board", "date": "2022-03-04 17:41", "summary": "The boss of the videogame publisher has served as a director for the company since 2012. Coca-Cola Co. said Activision Blizzard Inc. Chief Executive Bobby Kotick won't stand for re-election to its board of directors."}, {"source": "wsj", "link": "https://www.wsj.com/articles/commodity-funds-draw-bets-ukraine-invasion-russia-sanctions-will-stoke-rally-11646370755", "title": "Commodity Funds Draw Bets Ukraine War Will Stoke Rally", "date": "2022-03-04 16:45", "summary": "War grips global markets, lifting prices of raw materials including wheat and aluminum as investors wager on persistence of inflation. Investors are raising bets that the invasion of Ukraine and sanctions on Russia will further fuel an already-hot commodities rally."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-mortgage-interest-rate-deduction-works-2022-11646429952", "title": "Mortgage Interest Deduction: How It Works In 2022", "date": "2022-03-04 16:39", "summary": "The expansion of the standard deduction and a lower limit on deductible mortgage debt mean fewer filers are taking this popular write-off. The number of taxpayers claiming mortgage interest deductions on Schedule A has dropped sharply since the 2017 tax overhaul enacted both direct and indirect curbs on them. For 2019, about 13 million filers claimed the deduction vs. about 33 million for 2017, according to the latest IRS data."}, {"source": "wsj", "link": "https://www.wsj.com/articles/u-s-funding-markets-show-signs-of-stability-despite-russia-sanctions-11646359036", "title": "U.S. Funding Markets Show Signs of Stability Despite Russia Sanctions", "date": "2022-03-04 16:00", "summary": "Borrowing rates have ticked up, but there are few indications of cash-hoarding after steps are taken to isolate the Ukraine invader from global financial system. U.S. funding markets have remained relatively calm in recent days, easing the most-immediate concerns that sanctions against Russia would disrupt the basic functioning of the global financial system."}, {"source": "wsj", "link": "https://www.wsj.com/articles/disney-to-roll-out-cheaper-ad-supported-subscription-in-late-2022-11646405231", "title": "Disney+ to Roll Out Cheaper, Ad-Supported Subscription", "date": "2022-03-04 13:12", "summary": "Disney joins competitors WarnerMedia, NBCUniversal and Paramount in ad-supported model as pressure builds to jump-start subscriber growth. Walt Disney Co. told investors just over a year ago that the idea of a cheaper, ad-supported subscription offering for its Disney+ streaming platform was anathema."}, {"source": "wsj", "link": "https://www.wsj.com/articles/my-millennial-friends-rethink-life-i-should-too-11646342194", "title": "All My Millennial Friends Are Rethinking Their Lives. Maybe I Should, Too", "date": "2022-03-04 12:49", "summary": "In the Young Money column: I don't really know how big the gap is between what I want from life and how I'm living it. But it's time to figure it out.. Last spring, on a terrace overlooking Bryant Park in Manhattan, one of my closest friends-the first of several roommates in my 13 years of living in New York City-married his beautiful bride."}, {"source": "wsj", "link": "https://www.wsj.com/articles/reddit-apes-arent-blown-away-by-ken-griffins-hobby-11646416123", "title": "Reddit Apes Aren't Blown Away by Ken Griffin's Hobby", "date": "2022-03-04 12:48", "summary": "Citadel boss's 'Call of Duty' revelation draws snark online. Judging by the chatter on Reddit, Ken Griffin is some sort of cross between Darth Vader and Mr. Burns from \"The Simpsons\"-an all-powerful yet clueless financial villain."}, {"source": "wsj", "link": "https://www.wsj.com/articles/job-market-looks-even-tighter-as-covid-19-recedes-11646414426", "title": "Job Market Looks Even Tighter as Covid-19 Recedes", "date": "2022-03-04 12:20", "summary": "A robust employment report and receding infections point to an even hotter U.S. labor market this spring. The combination of falling Covid-19 cases and rising opportunities is drawing more people back into the job market. That doesn't mean it is getting easier for companies to hire."}, {"source": "wsj", "link": "https://www.wsj.com/articles/tesla-gets-approval-for-vehicle-production-in-germany-11646407608", "title": "Tesla Gets Approval to Start EV Production in Germany", "date": "2022-03-04 11:36", "summary": "Formal opening marks next step in Elon Musk's global expansion drive. BERLIN-Tesla Inc. has secured local approvals in Germany to formally begin electric-vehicle productions at its new plant outside Berlin, a key pillar of Chief Executive Elon Musk's push to rapidly boost output and sales."}, {"source": "wsj", "link": "https://www.wsj.com/articles/stock-markets-usually-go-up-sometimes-they-go-away-russia-etf-11646411622", "title": "Stock Markets Usually Go Up. Sometimes, They Go Away.", "date": "2022-03-04 11:34", "summary": "Trading on the Moscow stock exchange was suspended this past week. It's the latest reminder to investors that markets aren't always liquid.. This week, the stock market shut down in Moscow, and Russian shares collapsed on other exchanges, including in London and New York. Exchange-traded funds specializing in Russian stocks are down 90% or more from their highs shortly before the invasion of Ukraine-but, as of Friday, most of them are also frozen."}, {"source": "wsj", "link": "https://www.wsj.com/articles/crypto-frauds-target-ukrainian-donations-11646408697", "title": "Crypto Frauds Target Ukrainian Donations", "date": "2022-03-04 10:44", "summary": "Some schemes launched in wake of Russian invasion try to trick donors into sending crypto to fraudsters, research firm says. Cryptocurrency frauds are trying to take advantage of an outpouring of support for Ukraine."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hellman-friedman-takes-7-5-stake-in-software-maker-splunk-11646389802", "title": "Hellman & Friedman Takes 7.5% Stake in Software Maker Splunk", "date": "2022-03-04 10:18", "summary": "The private-equity firm's stake is worth about $1.4 billion. Private-equity firm Hellman & Friedman LLC has taken a 7.5% stake in Splunk Inc. worth about $1.4 billion, a big bet on the software company and its incoming chief executive."}, {"source": "wsj", "link": "https://www.wsj.com/articles/grabs-28-billion-market-plunge-shows-perils-of-spac-mergers-11646397492", "title": "Grab's Stock Plunge Shows the Perils of SPAC Mergers", "date": "2022-03-04 10:00", "summary": "Company is latest in a string of SPAC deals that have performed poorly in the stock market. Grab Holdings Ltd. , the Southeast Asian superapp that set a high watermark for SPAC mergers last year, has quickly become one of the market's biggest post-listing flops."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-us-stimulus-payments-helped-meme-stock-craze-11646341966", "title": "U.S. Stimulus Payments May Have Helped Fuel the Meme-Stock Craze", "date": "2022-03-04 10:00", "summary": "A new study finds that shares of meme stocks soared in the weeks after individual investors received their first two rounds of checks. Meme stocks were one of the biggest market phenomena during the pandemic. And federal stimulus payments appear to have done a lot to fuel the surge."}, {"source": "wsj", "link": "https://www.wsj.com/articles/coal-runs-hot-as-russia-ukraine-war-risks-europes-climate-agenda-11646402902", "title": "Coal Runs Hot as Russia-Ukraine War Risks Europe's Climate Agenda", "date": "2022-03-04 09:08", "summary": "Utilities, traders jostle for coal amid concerns of deepening energy crisis, propelling prices to all-time highs. The war in Ukraine scrambled global energy markets, with one especially unloved commodity-coal-enjoying a renaissance as European countries look again at the dirty fuel to establish energy independence from Russia."}, {"source": "wsj", "link": "https://www.wsj.com/articles/costco-smith-wesson-splunk-gap-broadcom-what-to-watch-when-the-stock-market-opens-today-11646394389", "title": "Costco, Smith & Wesson, Splunk, Gap, Broadcom: What to Watch When the Stock Market Opens Today", "date": "2022-03-04 08:13", "summary": "Smith & Wesson's earnings report missed the target; Clothing retailer Gap's results came in ahead of expectations. Stock futures and global stock indexes fell as concerns mounted about Russia's intensifying military campaign in Ukraine (live coverage). Russia's central bank kept the Moscow stock market largely closed for a fifth straight day. Here's what we're watching in Friday's trading:"}, {"source": "wsj", "link": "https://www.wsj.com/articles/sony-honda-to-team-up-in-developing-selling-electric-vehicles-11646376814", "title": "Sony, Honda to Team Up in Developing, Selling Electric Vehicles", "date": "2022-03-04 08:10", "summary": "Companies plan joint venture that would start selling EVs in 2025. TOKYO- Honda Motor Co. and Sony Group Corp. said they were teaming up to build electric vehicles, bringing together two big Japanese brands that have missed out on some major technology trends this century."}, {"source": "wsj", "link": "https://www.wsj.com/articles/justice-department-investigates-chicken-companies-information-sharing-on-labor-11646397000", "title": "U.S. Antitrust Probe Eyes Poultry Firms' Labor Practices", "date": "2022-03-04 07:30", "summary": "Justice Department starts civil antitrust probe to examine if an information exchange contributed to keeping wages lower for workers. The Justice Department is investigating whether poultry companies have engaged in anticompetitive sharing about employment practices that held down plant workers' wages, according to people familiar with the matter."}, {"source": "wsj", "link": "https://www.wsj.com/articles/batman-has-a-big-hole-to-fill-for-theaters-11646395201", "title": "Batman Has a Big Hole to Fill for Theaters", "date": "2022-03-04 07:00", "summary": "The box office is now fully dependent on superhero blockbusters, leaving Wall Street skeptical of a full recovery for cinemas. Such is the state of America's movie theater industry that even the bleakest of superheroes is being counted on to brighten up the business."}, {"source": "wsj", "link": "https://www.wsj.com/articles/japan-sticks-to-russian-oil-and-gas-bucking-western-pullouts-11646392575", "title": "Japan Sticks to Russian Oil and Gas, Bucking Western Pullouts", "date": "2022-03-04 06:16", "summary": "Tokyo cites decades of investments in Sakhalin projects and need to avoid dependence on Middle East. TOKYO-The Japanese government and local companies are sticking with their Russian energy deals, defying a pullout led by Western companies."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-does-the-u-s-still-buy-russian-oil-11646151935", "title": "Why Does the U.S. Buy Russian Oil?", "date": "2022-03-04 05:54", "summary": "Despite being the top global producer, the U.S. turns to Russian crude to service more-isolated coastal markets and keep refineries running at optimal levels. The fracking boom made America the world's biggest oil producer a few years ago, but the U.S. still imports millions of barrels each day from other parts of the world, including Russia."}, {"source": "wsj", "link": "https://www.wsj.com/articles/why-chinas-banks-wont-come-to-russias-rescue-11646389803", "title": "Why China's Banks Won't Come to Russia's Rescue", "date": "2022-03-04 05:30", "summary": "The risk of additional sanctions deters Chinese lenders, while a fledgling payment network relies on the Swift global system. On paper, China's banks and its homegrown payments system could offer Russia respite from crippling Western sanctions. China has helped other nations evade sanctions, and both China and Russia share an interest in weakening the dollar's hold on the international financial system."}, {"source": "wsj", "link": "https://www.wsj.com/articles/is-it-the-end-of-the-road-for-computing-power-11646389802", "title": "Is It the End of the Road for Computing Power?", "date": "2022-03-04 05:30", "summary": "That phone in your pocket was predicted by Moore's Law, but it is bumping against its physical and economic limits. It may not be an actual law of nature, but a bold statement made decades ago has predicted the dizzying advance of technology. Now it is about to falter. The business that powers everything around us from cars to smartphones to our utilities faces a reckoning."}, {"source": "wsj", "link": "https://www.wsj.com/articles/chris-cocks-is-hasbros-gamer-in-chief-11646389842", "title": "Hasbro's Gamer in Chief", "date": "2022-03-04 05:30", "summary": "The toy maker's new CEO loves Dungeons & Dragons and Magic: The Gathering. Now he's playing against an activist investor, a surging rival and a slowing toy market.. PAWTUCKET, R.I.-Chris Cocks played with G.I. Joe and Transformers action figures as a child. Then he moved on to Dungeons & Dragons and Magic: The Gathering. He's still playing both at 48."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-much-more-expensive-used-and-new-cars-are-in-2022-11646350633", "title": "How Much More Used and New Cars Cost Now", "date": "2022-03-04 05:30", "summary": "See for yourself how buying and owning a vehicle costs more than it has in years. We are delighted that you'd like to resume your subscription."}, {"source": "wsj", "link": "https://www.wsj.com/articles/europes-food-delivery-stocks-are-appetizingly-cheap-11646387187", "title": "Europe's Food Delivery Stocks Are Appetizingly Cheap", "date": "2022-03-04 04:46", "summary": "Shares in takeout apps such as Delivery Hero now trade below pre-Covid levels, despite new eating habits. Europe's fast-growing food apps can add inflation to their list of problems. But changes in consumer eating patterns caused by the pandemic are sticking so far and valuations seem undercooked."}, {"source": "wsj", "link": "https://www.wsj.com/articles/carlos-ghosn-criticizes-judge-in-trial-in-tokyo-of-former-nissan-aide-11646317343", "title": "Carlos Ghosn Blasts Tokyo Judge Who Called Him Greedy", "date": "2022-03-04 21:21", "summary": "Japan court delivers a de facto verdict in case of former Nissan CEO, who says ruling shows why he needed to escape to Lebanon. TOKYO-A Tokyo judge lashed out at fugitive car executive Carlos Ghosn, calling him a greedy and malicious criminal, and Mr. Ghosn said the statements proved why he couldn't have gotten a fair trial in Japan."}, {"source": "wsj", "link": "https://www.wsj.com/articles/once-slated-to-be-americas-priciest-home-the-one-sells-at-auction-for-just-126-million-11646353950", "title": "Once Slated to be America's Priciest Home, The One Sells at Auction for Just $126 Million", "date": "2022-03-04 19:32", "summary": "Developer Nile Niami once planned to list his L.A. megamansion for $500 million, but later faced construction delays and cost overruns. Once slated to list with a $500 million asking price, a Bel-Air megamansion known as The One has sold for just $126 million at a no-reserve auction, according to a spokeswoman at Concierge Auctions. The buyer, who couldn't immediately be identified, will also have to pay an auction premium, bringing their total bill to roughly $141 million."}, {"source": "wsj", "link": "https://www.wsj.com/articles/hundreds-of-new-york-times-tech-staffers-vote-to-unionize-11646352666", "title": "Hundreds of New York Times Tech Staffers Vote to Unionize", "date": "2022-03-04 19:11", "summary": "Group of some 600 employees will form largest U.S. union of tech workers with bargaining rights, NewsGuild says. Tech staffers at New York Times Co. have voted to unionize, creating the largest union of tech workers with bargaining rights in the country, the NewsGuild of New York said Thursday."}]