[{"source": "wsj", "link": "https://www.wsj.com/articles/icahn-nominates-two-to-mcdonalds-board-sources-say-11645390277", "title": "Carl Icahn Nominates Two to McDonald's Board", "date": "2022-02-20 16:46", "summary": "The proxy fight comes as the activist investor pushes the fast-food chain to require suppliers to change treatment of pigs. Carl Icahn has launched a proxy fight for two board seats at McDonald's Corp. , as the activist investor pushes the fast-food chain to require its suppliers to change their treatment of pigs."}, {"source": "wsj", "link": "https://www.wsj.com/articles/burning-electric-vehicle-batteries-complicate-efforts-to-fight-fire-on-drifting-ship-in-atlantic-ocean-11645385571", "title": "EV Batteries Hinder Efforts to Fight Fire on Ship", "date": "2022-02-20 15:05", "summary": "The incident could raise questions about the safety of ferrying EVs over long distances at sea. The large number of electric vehicles on board a ship that is drifting ablaze in the Atlantic Ocean is complicating efforts to extinguish the fire, the Dutch experts contracted to salvage the vessel said Sunday."}, {"source": "wsj", "link": "https://www.wsj.com/articles/russia-ukraine-tensions-power-gold-to-eight-month-highs-11645305172", "title": "Russia-Ukraine Tensions Power Gains for Gold", "date": "2022-02-20 13:06", "summary": "Geopolitical worries fuel gains even as expectations for interest-rate increases weigh on the climb. Escalating tensions between Russia and Ukraine have boosted gold prices to their highest levels since June."}, {"source": "wsj", "link": "https://www.wsj.com/articles/how-to-overcome-fear-applying-for-promotion-11645217491", "title": "How to Overcome the Fear of Applying for a Promotion", "date": "2022-02-20 11:00", "summary": "Research suggests the key is to consider both the positives and the negatives. Imagine you want to raise your hand for a new job, which would mean a big promotion. But you hesitate, afraid of being rejected."}, {"source": "wsj", "link": "https://www.wsj.com/articles/surfside-tower-collapse-makes-buying-condos-more-complicated-11645289834", "title": "Surfside Tower Collapse Makes Buying Condos More Complicated", "date": "2022-02-20 10:03", "summary": "Fannie Mae, Freddie Mac are asking more questions about building safety, but they aren't so easy to answer. Fannie Mae and Freddie Mac are asking questions about the safety and soundness of condos and co-op buildings after the Surfside, Fla., tower collapse. There is little agreement on how to answer them."}, {"source": "wsj", "link": "https://www.wsj.com/articles/what-ceos-are-saying-even-wealthier-families-become-more-price-sensitive-11645362000", "title": "What CEOs Are Saying: 'Even Wealthier Families Become More Price-Sensitive'", "date": "2022-02-20 08:00", "summary": "Leaders from Walmart, Kraft Heinz, Nvidia and other companies share their thoughts about inflation, supply chain and future tech. "}, {"source": "wsj", "link": "https://www.wsj.com/articles/remote-lets-generation-z-work-without-any-office-will-matter-11645220523", "title": "Thanks to Remote Work, Many in Gen Z May Never Work in an Office. Will It Matter?", "date": "2022-02-20 05:30", "summary": "Many younger people say they always want to work remotely. But researchers say their personal and professional lives may suffer.. Shannon Chin went from working and learning remotely in college to working two jobs remotely while staying with family in the Toronto area. She didn't meet her colleagues face to face at one of those jobs, in user experience, until December-nearly a year and a half after signing on. In fact, she hadn't seen their faces at all."}]